sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
          </fields>
        </register>
        <register>
          <name>WLLIM</name>
          <description>Window Comparator Lower Limits Register</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>

          <fields>
            <field>
              <name>LLIM</name>
              <description>Sets the lower limit for the window comparator.</description>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SCWLIM</name>
          <description>Scale Window Comparator Limits</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>SCWLIMEN</name>
              <description>Scale the window limits compare values per precision mode. When set to 0x0 (default), the values in the 20-bit limits registers will compare directly with the FIFO values regardless of the precision mode the slot is configured to.  When set to 0x1, the compare values will be divided by the difference in precision bits while performing the window limit comparisons.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFO</name>
          <description>FIFO Data and Valid Count Register</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7FFFFFFF</resetMask>

          <fields>
            <field>
              <name>RSVD</name>
              <description>RESERVED.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SLOTNUM</name>
              <description>Slot number associated with this FIFO data.</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>COUNT</name>
              <description>Number of valid entries in the ADC FIFO.</description>
              <bitRange>[27:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DATA</name>
              <description>Oldest data in the FIFO.</description>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFOPR</name>
          <description>FIFO Data and Valid Count Register</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>RSVDPR</name>
              <description>RESERVED.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SLOTNUMPR</name>
              <description>Slot number associated with this FIFO data.</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>COUNT</name>
              <description>Number of valid entries in the ADC FIFO.</description>
              <bitRange>[27:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DATA</name>
              <description>Oldest data in the FIFO.</description>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>ADC Interrupt registers: Enable</description>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>DERR</name>
              <description>DMA Error Condition</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAERROR</name>
                  <description>DMA Error Condition Occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMP</name>
              <description>DMA Transfer Complete</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMACOMPLETE</name>
                  <description>DMA Completed a transfer</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WCINC</name>
              <description>Window comparator voltage incursion interrupt.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WCINCINT</name>
                  <description>Window comparitor voltage incursion interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WCEXC</name>
              <description>Window comparator voltage excursion interrupt.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WCEXCINT</name>
                  <description>Window comparitor voltage excursion interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOOVR2</name>
              <description>FIFO 100 percent full interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIFOFULLINT</name>
                  <description>FIFO 100 percent full interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOOVR1</name>
              <description>FIFO 75 percent full interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIFO75INT</name>
                  <description>FIFO 75 percent full interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCNCMP</name>
              <description>ADC scan complete interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCNCMPINT</name>
                  <description>ADC scan complete interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CNVCMP</name>
              <description>ADC conversion complete interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNVCMPINT</name>
                  <description>ADC conversion complete interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTSTAT</name>
          <description>ADC Interrupt registers: Status</description>
          <addressOffset>0x00000204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>DERR</name>
              <description>DMA Error Condition</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAERROR</name>
                  <description>DMA Error Condition Occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMP</name>
              <description>DMA Transfer Complete</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMACOMPLETE</name>
                  <description>DMA Completed a transfer</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WCINC</name>
              <description>Window comparator voltage incursion interrupt.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WCINCINT</name>
                  <description>Window comparitor voltage incursion interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WCEXC</name>
              <description>Window comparator voltage excursion interrupt.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WCEXCINT</name>
                  <description>Window comparitor voltage excursion interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOOVR2</name>
              <description>FIFO 100 percent full interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIFOFULLINT</name>
                  <description>FIFO 100 percent full interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOOVR1</name>
              <description>FIFO 75 percent full interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIFO75INT</name>
                  <description>FIFO 75 percent full interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCNCMP</name>
              <description>ADC scan complete interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCNCMPINT</name>
                  <description>ADC scan complete interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CNVCMP</name>
              <description>ADC conversion complete interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNVCMPINT</name>
                  <description>ADC conversion complete interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCLR</name>
          <description>ADC Interrupt registers: Clear</description>
          <addressOffset>0x00000208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>DERR</name>
              <description>DMA Error Condition</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAERROR</name>
                  <description>DMA Error Condition Occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMP</name>
              <description>DMA Transfer Complete</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMACOMPLETE</name>
                  <description>DMA Completed a transfer</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WCINC</name>
              <description>Window comparator voltage incursion interrupt.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WCINCINT</name>
                  <description>Window comparitor voltage incursion interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WCEXC</name>
              <description>Window comparator voltage excursion interrupt.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WCEXCINT</name>
                  <description>Window comparitor voltage excursion interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOOVR2</name>
              <description>FIFO 100 percent full interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIFOFULLINT</name>
                  <description>FIFO 100 percent full interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOOVR1</name>
              <description>FIFO 75 percent full interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIFO75INT</name>
                  <description>FIFO 75 percent full interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCNCMP</name>
              <description>ADC scan complete interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCNCMPINT</name>
                  <description>ADC scan complete interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CNVCMP</name>
              <description>ADC conversion complete interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNVCMPINT</name>
                  <description>ADC conversion complete interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTSET</name>
          <description>ADC Interrupt registers: Set</description>
          <addressOffset>0x0000020C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>DERR</name>
              <description>DMA Error Condition</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAERROR</name>
                  <description>DMA Error Condition Occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMP</name>
              <description>DMA Transfer Complete</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMACOMPLETE</name>
                  <description>DMA Completed a transfer</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WCINC</name>
              <description>Window comparator voltage incursion interrupt.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WCINCINT</name>
                  <description>Window comparitor voltage incursion interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WCEXC</name>
              <description>Window comparator voltage excursion interrupt.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WCEXCINT</name>
                  <description>Window comparitor voltage excursion interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOOVR2</name>
              <description>FIFO 100 percent full interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIFOFULLINT</name>
                  <description>FIFO 100 percent full interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOOVR1</name>
              <description>FIFO 75 percent full interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIFO75INT</name>
                  <description>FIFO 75 percent full interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCNCMP</name>
              <description>ADC scan complete interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCNCMPINT</name>
                  <description>ADC scan complete interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CNVCMP</name>
              <description>ADC conversion complete interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNVCMPINT</name>
                  <description>ADC conversion complete interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMATRIGEN</name>
          <description>DMA Trigger Enable Register</description>
          <addressOffset>0x00000240</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>DFIFOFULL</name>
              <description>Trigger DMA upon FIFO 100 percent Full</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

