sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
      </registers>
    </peripheral>

    <peripheral>
      <name>BLEIF</name>
      <version>1.0</version>
      <description>BLE Interface</description>
      <!-- <groupName>GROUP_BLEIF</groupName> -->
      <baseAddress>0x5000C000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000414</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>BLE</name>
        <value>12</value>
      </interrupt>
      <registers>
        <register>
          <name>FIFO</name>
          <description>FIFO Access Port</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FIFO</name>
              <description>FIFO direct access. Only locations 0 - 3F will return valid information.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFOPTR</name>
          <description>FIFO size and remaining slots open values</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FIFO1REM</name>
              <description>The number of remaining data bytes slots currently in FIFO 1 (written by interface, read by MCU)</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIFO1SIZ</name>
              <description>The number of valid data bytes currently in FIFO 1 (written by interface, read by MCU)</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIFO0REM</name>
              <description>The number of remaining data bytes slots currently in FIFO 0 (written by MCU, read by interface)</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIFO0SIZ</name>
              <description>The number of valid data bytes currently in the FIFO 0 (written by MCU, read by interface)</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFOTHR</name>
          <description>FIFO Threshold Configuration</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00003F3F</resetMask>

          <fields>
            <field>
              <name>FIFOWTHR</name>
              <description>FIFO write threshold in bytes.  A value of 0 will disable the write FIFO level from activating the threshold interrupt. If this field is non-zero, it will trigger a threshold interrupt when the write fifo contains FIFOWTHR free bytes, as indicated by the FIFO0REM field.  This is intended to signal when a transfer of FIFOWTHR bytes can be done from the host to the IOM write fifo to support large IOM write operations.</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIFORTHR</name>
              <description>FIFO read threshold in bytes.  A value of 0 will disable the read FIFO level from activating the threshold interrupt. If this field is non-zero, it will trigger a threshold interrupt when the read fifo contains FIFORTHR valid bytes of data, as indicated by the FIFO1SIZ field.  This is intended to signal when a data transfer of FIFORTHR bytes can be done from the IOM module to the host via the read fifo to support large IOM read operations.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFOPOP</name>
          <description>FIFO POP register</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FIFODOUT</name>
              <description>This register will return the read data indicated by the current read pointer on reads. If the POPWR control bit in the FIFOCTRL register is reset (0), the fifo read pointer will be advanced by one word as a result of the read.
If the POPWR bit is set (1), the fifo read pointer will only be advanced after a write operation to this register.  The write data is ignored for this register.
If less than a even word multiple is available, and the command is completed, the module will return the word containing these bytes and undetermined data in the unused fields of the word.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFOPUSH</name>
          <description>FIFO PUSH register</description>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FIFODIN</name>
              <description>This register is used to write the FIFORAM in FIFO mode and will cause a push event to occur to the next open slot within the FIFORAM.  Writing to this register will cause the write point to increment by 1 word(4 bytes).</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

