sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
            <field>
              <name>CMDSEL</name>
              <description>Command Specific selection information</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TSIZE</name>
              <description>Defines the transaction size in bytes.  The offset transfer is not included in this size.</description>
              <bitRange>[19:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CONT</name>
              <description>Contine to hold the bus after the current transaction if set to a 1 with a new command issued.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OFFSETCNT</name>
              <description>Number of offset bytes to use for the command - 0, 1, 2, 3 are valid selections. The second (byte 1) and third byte (byte 2) are read from the OFFSETHI register, and the low order byte is pulled from this register in the OFFSETLO field.
Offset bytes are transmitted highest byte first.  EG if offsetcnt == 3, OFFSETHI[15:8] will be transmitted first, then OFFSETHI[7:0] then OFFSETLO.
If offsetcnt == 2, OFFSETHI[7:0] will be transmitted, then OFFSETLO.
If offsetcnt == 1, only OFFSETLO will be transmitted.
Offset bytes are always transmitted MSB first, regardless of the value of the LSB control bit within the module configuration.</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CMD</name>
              <description>Command for submodule.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITE</name>
                  <description>Write command using count of offset bytes specified in the OFFSETCNT field</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read command using count of offset bytes specified in the OFFSETCNT field</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CMDRPT</name>
          <description>Command Repeat Register</description>
          <addressOffset>0x00000210</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>

          <fields>
            <field>
              <name>CMDRPT</name>
              <description>Count of number of times to repeat the next command.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>OFFSETHI</name>
          <description>High order offset bytes</description>
          <addressOffset>0x00000214</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>OFFSETHI</name>
              <description>Holds the high order bytes of the 2 or 3 byte offset phase of a transaction.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CMDSTAT</name>
          <description>Command status</description>
          <addressOffset>0x00000218</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>

          <fields>
            <field>
              <name>CTSIZE</name>
              <description>The current number of bytes still to be transferred with this command.  This field will count down to zero.</description>
              <bitRange>[19:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CMDSTAT</name>
              <description>The current status of the command execution.</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERR</name>
                  <description>Error encountered with command</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Actively processing command</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>Idle state, no active command, no error</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT</name>
                  <description>Command in progress, but waiting on data from host</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCMD</name>
              <description>current command that is being executed</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>IO Master Interrupts: Enable</description>
          <addressOffset>0x00000220</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0001FFFF</resetMask>

          <fields>
            <field>
              <name>B2MSHUTDN</name>
              <description>Revision A: The B2M_STATE from the BLE Core transitioned into shutdown state  Revision B: Falling BLE Core Status signal. Asserted when the BLE_STATUS signal from the BLE Core is de-asserted (1 -> 0)</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

