sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
            <field>
              <name>B2MACTIVE</name>
              <description>Revision A: The B2M_STATE from the BLE Core transitioned into the active state  Revision B: Falling BLE Core IRQ signal. Asserted when the BLE_IRQ signal from the BLE Core is de-asserted (1 -> 0)</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>B2MSLEEP</name>
              <description>The B2M_STATE from the BLE Core transitioned into the sleep state</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CQERR</name>
              <description>Command queue error during processing.  When an error occurs, the system will stop processing and halt operations to allow software to take recovery actions</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CQUPD</name>
              <description>Command queue write operation executed a register write with the register address bit 0 set to 1.  The low address bits in the CQ address fields are unused and bit 0 can be used to trigger an interrupt to indicate when this register write is performed by the CQ operation.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CQPAUSED</name>
              <description>Command queue is paused due to an active event enabled in the PAUSEEN register.  The interrupt is posted when the event is enabled within the PAUSEEN register, the mask is active in the CQIRQMASK field and the event occurs.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DERR</name>
              <description>DMA Error encountered during the processing of the DMA command.  The DMA error could occur when the memory access specified in the DMA operation is not available or incorrectly specified.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DCMP</name>
              <description>DMA Complete. Processing of the DMA operation has completed and the DMA submodule is returned into the idle state</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BLECSSTAT</name>
              <description>BLE Core SPI Status interrupt.  Asserted when the SPI_STATUS signal from the BLE Core is asserted, indicating that SPI writes can be done to the BLE Core.
Transfers to the BLE Core should only be done when this signal is high.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BLECIRQ</name>
              <description>BLE Core IRQ signal. Asserted when the BLE_IRQ signal from the BLE Core is asserted, indicating the availability of read data from the BLE Core.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ICMD</name>
              <description>illegal command interrupt. Asserted when a command is written when an active command is in progress.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IACC</name>
              <description>illegal FIFO access interrupt. Asserted when there is a overflow or underflow event</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>B2MST</name>
              <description>B2M State change interrupt. Asserted on any change in the B2M_STATE signal from the BLE Core.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FOVFL</name>
              <description>Write FIFO Overflow interrupt. This occurs when software tries to write to a full fifo.  The current operation does not stop.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FUNDFL</name>
              <description>Read FIFO Underflow interrupt. Asserted when a pop operation is done to a empty read FIFO.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>THR</name>
              <description>FIFO Threshold interrupt. For write operations, asserted when the number of free bytes in the write FIFO equals or exceeds the WTHR field.
For read operations, asserted when the number of valid bytes in the read FIFO equals of exceeds the value set in the RTHR field.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CMDCMP</name>
              <description>Command Complete interrupt. Asserted when the current operation has completed.   For repeated commands, this will only be asserted when the final repeated command is completed.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTSTAT</name>
          <description>IO Master Interrupts: Status</description>
          <addressOffset>0x00000224</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0001FFFF</resetMask>

          <fields>
            <field>
              <name>B2MSHUTDN</name>
              <description>Revision A: The B2M_STATE from the BLE Core transitioned into shutdown state  Revision B: Falling BLE Core Status signal. Asserted when the BLE_STATUS signal from the BLE Core is de-asserted (1 -> 0)</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

