sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
            <field>
              <name>DCMDCMPEN</name>
              <description>Trigger DMA upon command complete.  Enables the trigger of the DMA when a command is completed.  When this event is triggered, the number of words transferred will be the lesser of the remaining TOTCOUNT bytes, or the number of bytes in the FIFO when the command completed.  If this is disabled, and the number of bytes in the FIFO is equal or greater than the TOTCOUNT bytes, a transfer of TOTCOUNT bytes will be done to ensure read data is stored when the DMA is completed.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMATRIGSTAT</name>
          <description>DMA Trigger Status Register</description>
          <addressOffset>0x00000234</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>DTOTCMP</name>
              <description>DMA triggered when DCMDCMP = 0, and the amount of data in the FIFO was enough to complete the DMA operation (greater than or equal to current TOTCOUNT) when the command completed. This trigger is default active when the DCMDCMP trigger is
disabled and there is enough data in the FIFO to complete the DMA operation.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DTHR</name>
              <description>Triggered DMA from THR event. Bit is read only and can be cleared by disabling the DTHR trigger enable or by disabling DMA.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DCMDCMP</name>
              <description>Triggered DMA from Command complete event.   Bit is read only and can be cleared by disabling the DCMDCMP trigger enable or by disabling DMA.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMACFG</name>
          <description>DMA Configuration Register</description>
          <addressOffset>0x00000238</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000103</resetMask>

          <fields>
            <field>
              <name>DMAPRI</name>
              <description>Sets the Priority of the DMA request</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low Priority (service as best effort)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High Priority (service immediately)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMADIR</name>
              <description>Direction</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P2M</name>
                  <description>Peripheral to Memory (SRAM) transaction.  To be set when doing IOM read operations, ie reading data from external devices.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2P</name>
                  <description>Memory to Peripheral transaction.  To be set when doing IOM write operations, ie writing data to external devices.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMA Enable. Setting this bit to EN will start the DMA operation. This should be the last DMA related register set prior to issuing the command</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable DMA Function</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable DMA Function</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMATOTCOUNT</name>
          <description>DMA Total Transfer Count</description>
          <addressOffset>0x0000023C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>

          <fields>
            <field>
              <name>TOTCOUNT</name>
              <description>Triggered DMA from Command complete event occured.   Bit is read only and can be cleared by disabling the DTHR trigger enable or by disabling DMA.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMATARGADDR</name>
          <description>DMA Target Address Register</description>
          <addressOffset>0x00000240</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x101FFFFF</resetMask>

          <fields>
            <field>
              <name>TARGADDR28</name>
              <description>Bit 28 of the target byte address for source of DMA (either read or write). In cases of non-word aligned addresses, the DMA logic will take care for ensuring only the target bytes are read/written.
Setting to '1' will select the SRAM.  Setting to '0' will select the flash</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

