sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
            <field>
              <name>TARGADDR</name>
              <description>Bits [19:0] of the target byte address for source of DMA (either read or write). The address can be any byte alignment, and does not have to be word aligned.  In cases of non-word aligned addresses, the DMA logic will take care for ensuring only the target bytes are read/written.</description>
              <bitRange>[20:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMASTAT</name>
          <description>DMA Status Register</description>
          <addressOffset>0x00000244</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>DMAERR</name>
              <description>DMA Error. This active high bit signals that an error was encountered during the DMA operation.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DMACPL</name>
              <description>DMA Transfer Complete. This signals the end of the DMA operation.  This bit can be cleared by writing to 0.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DMATIP</name>
              <description>DMA Transfer In Progress indicator.  1 will indicate that a DMA transfer is active.  The DMA transfer may be waiting on data, transferring data, or waiting for priority.
All of these will be indicated with a 1.  A 0 will indicate that the DMA is fully complete and no further transactions will be done.  This bit is read only.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CQCFG</name>
          <description>Command Queue Configuration Register</description>
          <addressOffset>0x00000248</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>CQPRI</name>
              <description>Sets the Priority of the command queue dma request.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low Priority (service as best effort)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High Priority (service immediately)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CQEN</name>
              <description>Command queue enable. When set, will enable the processing of the command queue and fetches of address/data pairs will proceed from the word address within the CQADDR register.  Can be disabled
using a CQ executed write to this bit as well.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable CQ Function</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable CQ Function</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CQADDR</name>
          <description>CQ Target Read Address Register</description>
          <addressOffset>0x0000024C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x101FFFFC</resetMask>

          <fields>
            <field>
              <name>CQADDR28</name>
              <description>Bit 28 of target byte address for source of CQ (read only). Used to denote Flash (0) or SRAM (1) access</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CQADDR</name>
              <description>Bits 19:2 of target byte address for source of CQ (read only). The buffer must be aligned on a word boundary</description>
              <bitRange>[20:2]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CQSTAT</name>
          <description>Command Queue Status Register</description>
          <addressOffset>0x00000250</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>CQERR</name>
              <description>Command queue processing  Error. This active high bit signals that an error was encountered during the CQ  operation.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CQPAUSED</name>
              <description>Command queue operation is currently paused.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CQTIP</name>
              <description>Command queue Transfer In Progress indicator.  1 will indicate that a CQ transfer is active and this will remain active even when paused waiting for external event.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

