sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
          </fields>
        </register>
        <register>
          <name>CQENDIDX</name>
          <description>IOM Command Queue current index value . Compared to the CQCURIDX reg contents to generate the IDXEQ Pause event for command queue</description>
          <addressOffset>0x00000264</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>CQENDIDX</name>
              <description>Holds 8 bits of data that will be compared with the CQCURIX register field.  If the values match, the IDXEQ pause event will be activated, which will cause the pausing of command quue operation if the IDXEQ bit is enabled in CQPAUSEEN.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>IOM Module Status Register</description>
          <addressOffset>0x00000268</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>IDLEST</name>
              <description>indicates if the active I/O state machine is IDLE. Note - The state machine could be in idle state due to holdoffs from data availability, or as the command gets propagated into the logic from the registers.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>The I/O state machine is in the idle state.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDACT</name>
              <description>Indicates if the active I/O Command is currently processing a transaction, or command is complete, but the FIFO pointers are still syncronizing internally.  This bit will go high at
the start of the transaction, and will go low when the command is complete, and the data and pointers within the FIFO have been syncronized.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>An I/O command is active.  Indicates the active module has an active command and is processing this.   De-asserted when the command is completed.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERR</name>
              <description>Bit has been deprecated.  Please refer to the other error indicators.  This will always return 0.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERROR</name>
                  <description>Bit has been deprecated and will always return 0.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MSPICFG</name>
          <description>SPI module master configuration</description>
          <addressOffset>0x00000300</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <resetMask>0x7FE30007</resetMask>

          <fields>
            <field>
              <name>MSPIRST</name>
              <description>Bit is deprecated.  setting it will have no effect.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DOUTDLY</name>
              <description>Delay tap to use for the output signal (MOSI).  This give more hold time on the output data.</description>
              <bitRange>[29:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DINDLY</name>
              <description>Delay tap to use for the input signal (MISO).  This gives more hold time on the input data.</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SPILSB</name>
              <description>Selects data transfer as MSB first (0) or LSB first (1) for the data portion of the SPI transaction.   The offset bytes are always transmitted MSB first.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MSB</name>
                  <description>Send and receive MSB bit first</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSB</name>
                  <description>Send and receive LSB bit first</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDFCPOL</name>
              <description>Selects the read flow control signal polarity. When set, the clock will be held low until the flow control is de-asserted.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>SPI_STATUS signal from BLE Core high(1) creates flow control and new read spi transactions will not be started until the signal goes low.(default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED</name>
                  <description>SPI_STATUS signal from BLE Core low(0) creates flow control and new read spi transactions will not be started until the signal goes high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WTFCPOL</name>
              <description>Selects the write flow control signal polarity. The transfers are halted when the selected flow control signal is OPPOSITE polarity of this bit. (For example: WTFCPOL = 0 will allow a SPI_STATUS=1 to pause transfers).</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>SPI_STATUS signal from BLE Core high(1) creates flow control and new write spi transactions will not be started until the signal goes low.(default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED</name>
                  <description>SPI_STATUS signal from BLE Core high(1) creates low(0) control and new write spi transactions will not be started until the signal goes high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDFC</name>
              <description>Enables flow control of new read transactions based on the SPI_STATUS signal from the BLE Core.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Read mode flow control disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Read mode flow control enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WTFC</name>
              <description>Enables flow control of new write transactions based on the SPI_STATUS signal from the BLE Core.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Write mode flow control disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Write mode flow control enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FULLDUP</name>
              <description>Full Duplex mode.  Capture read data during writes operations</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

