sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
            <field>
              <name>APBCLKON</name>
              <description>APBCLK debug clock control.  Enable APB_CLK to be active when this bit is '1'.  Otherwise, the clock is controlled with gating from the logic as needed.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IOCLKON</name>
              <description>IOCLK debug clock control.  Enable IO_CLK to be active when this bit is '1'.  Otherwise, the clock is controlled with gating from the logic as needed.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DBGEN</name>
              <description>Debug Enable.  Setting this bit will enable the update of data within this register, otherwise it is clock gated for power savings</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>CACHECTRL</name>
      <version>1.0</version>
      <description>Flash Cache Controller</description>
      <!-- <groupName>GROUP_CACHECTRL</groupName> -->
      <baseAddress>0x40018000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000240</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <register>
          <name>CACHECFG</name>
          <description>Flash Cache Control Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00100C50</resetValue>
          <resetMask>0x01100FFF</resetMask>

          <fields>
            <field>
              <name>ENABLE_MONITOR</name>
              <description>Enable Cache Monitoring Stats.  Cache monitoring consumes additional power and should only be enabled when profiling code and counters will increment when this bit is set.  Counter values will be retained when this is set to 0, allowing software to enable/disable counting for multiple code segments.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DATA_CLKGATE</name>
              <description>Enable aggressive clock gating of entire data array.  This bit should be set to 1 for optimal power efficiency.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CACHE_LS</name>
              <description>Enable LS (light sleep) of cache RAMs.  Software should DISABLE this bit since cache activity is too high to benefit from LS usage.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CACHE_CLKGATE</name>
              <description>Enable clock gating of cache TAG RAM.  Software should enable this bit for optimal power efficiency.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DCACHE_ENABLE</name>
              <description>Enable Flash Data Caching.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ICACHE_ENABLE</name>
              <description>Enable Flash Instruction Caching</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CONFIG</name>
              <description>Sets the cache configuration</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>W1_128B_512E</name>
                  <description>Direct mapped, 128-bit linesize, 512 entries (4 SRAMs active)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>W2_128B_512E</name>
                  <description>Two-way set associative, 128-bit linesize, 512 entries (8 SRAMs active)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>W1_128B_1024E</name>
                  <description>Direct mapped, 128-bit linesize, 1024 entries (8 SRAMs active)</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE_NC1</name>
              <description>Enable Non-cacheable region 1.  See NCR1 registers to define the region.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ENABLE_NC0</name>
              <description>Enable Non-cacheable region 0.  See NCR0 registers to define the region.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LRU</name>
              <description>Sets the cache repleacment policy.  0=LRR (least recently replaced), 1=LRU (least recently used).  LRR minimizes writes to the TAG SRAM.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ENABLE</name>
              <description>Enables the flash cache controller and enables power to the cache SRAMs.  The ICACHE_ENABLE and DCACHE_ENABLE should be set to enable caching for each type of access.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

