sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>Cache Control</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00077777</resetMask>

          <fields>
            <field>
              <name>FLASH3_SLM_ENABLE</name>
              <description>Enable Flash Sleep Mode.  Write to 1 to put flash 1 into sleep mode.  NOTE: there is a 5us latency after waking flash until the first access will be returned.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FLASH3_SLM_DISABLE</name>
              <description>Disable Flash Sleep Mode.  Write 1 to wake flash1 from sleep mode (reading the array will also automatically wake it).</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FLASH3_SLM_STATUS</name>
              <description>Flash Sleep Mode Status.  1 indicates that flash1 is in sleep mode, 0 indicates flash1 is in normal mode.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FLASH2_SLM_ENABLE</name>
              <description>Enable Flash Sleep Mode.  Write to 1 to put flash 1 into sleep mode.  NOTE: there is a 5us latency after waking flash until the first access will be returned.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FLASH2_SLM_DISABLE</name>
              <description>Disable Flash Sleep Mode.  Write 1 to wake flash2 from sleep mode (reading the array will also automatically wake it).</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FLASH2_SLM_STATUS</name>
              <description>Flash Sleep Mode Status.  1 indicates that flash1 is in sleep mode, 0 indicates flash2 is in normal mode.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FLASH1_SLM_ENABLE</name>
              <description>Enable Flash Sleep Mode.  Write to 1 to put flash 1 into sleep mode.  NOTE: there is a 5us latency after waking flash until the first access will be returned.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FLASH1_SLM_DISABLE</name>
              <description>Disable Flash Sleep Mode.  Write 1 to wake flash1 from sleep mode (reading the array will also automatically wake it).</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FLASH1_SLM_STATUS</name>
              <description>Flash Sleep Mode Status.  1 indicates that flash1 is in sleep mode, 0 indicates flash1 is in normal mode.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FLASH0_SLM_ENABLE</name>
              <description>Enable Flash Sleep Mode.  Write to 1 to put flash 0 into sleep mode.  NOTE: there is a 5us latency after waking flash until the first access will be returned.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FLASH0_SLM_DISABLE</name>
              <description>Disable Flash Sleep Mode.  Write 1 to wake flash0 from sleep mode (reading the array will also automatically wake it).</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FLASH0_SLM_STATUS</name>
              <description>Flash Sleep Mode Status.  1 indicates that flash0 is in sleep mode, 0 indicates flash0 is in normal mode.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CACHE_READY</name>
              <description>Cache Ready Status (enabled and not processing an invalidate operation)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESET_STAT</name>
              <description>Reset Cache Statistics.  When written to a 1, the cache monitor counters will be cleared.  The monitor counters can be reset only when the CACHECFG.ENABLE_MONITOR bit is set.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Clear Cache Stats</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INVALIDATE</name>
              <description>Writing a 1 to this bitfield invalidates the flash cache contents.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>NCR0START</name>
          <description>Flash Cache Noncachable Region 0 Start</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07FFFFF0</resetMask>

          <fields>
            <field>
              <name>ADDR</name>
              <description>Start address for non-cacheable region 0</description>
              <bitRange>[26:4]</bitRange>
              <access>read-write</access>

