sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
          </fields>
        </register>
        <register>
          <name>IMON3</name>
          <description>Instruction Cache Line Hits</description>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ILINE_COUNT</name>
              <description>Cache hits from line cache</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FLASH0CFG</name>
          <description>Flash 0 Control Register</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000873</resetValue>
          <resetMask>0x00003F7F</resetMask>

          <fields>
            <field>
              <name>LPMMODE0</name>
              <description>Controls flash low power modes (control of LPM pin).</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEVER</name>
                  <description>High power mode (LPM not used).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STANDBY</name>
                  <description>Fast Standby mode.  LPM deasserted for read operations, but asserted while flash IDLE.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Low Power mode.  LPM always asserted for reads.  LPM_RD_WAIT must be programmed to accomodate longer read access times.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPMRDWAIT0</name>
              <description>Sets flash waitstates when in LPM Mode 2 (RD_WAIT in LPM mode 2 only)</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SEDELAY0</name>
              <description>Sets SE delay (flash address setup).  A value of 5 is recommended.</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RDWAIT0</name>
              <description>Sets read waitstates for normal (fast) operation.  A value of 1 is recommended.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FLASH1CFG</name>
          <description>Flash 1 Control Register</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000873</resetValue>
          <resetMask>0x00003F7F</resetMask>

          <fields>
            <field>
              <name>LPMMODE1</name>
              <description>Controls flash low power modes (control of LPM pin).</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEVER</name>
                  <description>High power mode (LPM not used).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STANDBY</name>
                  <description>Fast Standby mode.  LPM deasserted for read operations, but asserted while flash IDLE.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Low Power mode.  LPM always asserted for reads.  LPM_RD_WAIT must be programmed to accomodate longer read access times.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPMRDWAIT1</name>
              <description>Sets flash waitstates when in LPM Mode 2 (RD_WAIT in LPM mode 2 only)</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SEDELAY1</name>
              <description>Sets SE delay (flash address setup).  A value of 5 is recommended.</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RDWAIT1</name>
              <description>Sets read waitstates for normal (fast) operation.  A value of 1 is recommended.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FLASH2CFG</name>
          <description>Flash 2 Control Register</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000873</resetValue>
          <resetMask>0x00003F7F</resetMask>

          <fields>
            <field>
              <name>LPMMODE2</name>
              <description>Controls flash low power modes (control of LPM pin).</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEVER</name>
                  <description>High power mode (LPM not used).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STANDBY</name>
                  <description>Fast Standby mode.  LPM deasserted for read operations, but asserted while flash IDLE.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Low Power mode.  LPM always asserted for reads.  LPM_RD_WAIT must be programmed to accomodate longer read access times.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPMRDWAIT2</name>
              <description>Sets flash waitstates when in LPM Mode 2 (RD_WAIT in LPM mode 2 only)</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>

