sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
            <field>
              <name>OMODE</name>
              <description>Current RTC oscillator (1 => LFRC, 0 => XT).  After an RTC oscillator change, it may take up to 2 seconds for this field to reflect the new oscillator.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HFADJ</name>
          <description>HFRC Adjustment</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0025B800</resetValue>
          <resetMask>0x00FFFF0F</resetMask>

          <fields>
            <field>
              <name>HFADJGAIN</name>
              <description>Gain control for HFRC adjustment</description>
              <bitRange>[23:21]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Gain_of_1</name>
                  <description>HF Adjust with Gain of 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain_of_1_in_2</name>
                  <description>HF Adjust with Gain of 0.5</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain_of_1_in_4</name>
                  <description>HF Adjust with Gain of 0.25</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain_of_1_in_8</name>
                  <description>HF Adjust with Gain of 0.125</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain_of_1_in_16</name>
                  <description>HF Adjust with Gain of 0.0625</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Gain_of_1_in_32</name>
                  <description>HF Adjust with Gain of 0.03125</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFWARMUP</name>
              <description>XT warmup period for HFRC adjustment</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1SEC</name>
                  <description>Autoadjust XT warmup period = 1-2 seconds</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2SEC</name>
                  <description>Autoadjust XT warmup period = 2-4 seconds</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFXTADJ</name>
              <description>Target HFRC adjustment value.</description>
              <bitRange>[19:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HFADJCK</name>
              <description>Repeat period for HFRC adjustment</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4SEC</name>
                  <description>Autoadjust repeat period = 4 seconds</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16SEC</name>
                  <description>Autoadjust repeat period = 16 seconds</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32SEC</name>
                  <description>Autoadjust repeat period = 32 seconds</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64SEC</name>
                  <description>Autoadjust repeat period = 64 seconds</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128SEC</name>
                  <description>Autoadjust repeat period = 128 seconds</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256SEC</name>
                  <description>Autoadjust repeat period = 256 seconds</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512SEC</name>
                  <description>Autoadjust repeat period = 512 seconds</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024SEC</name>
                  <description>Autoadjust repeat period = 1024 seconds</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFADJEN</name>
              <description>HFRC adjustment control</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable the HFRC adjustment</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable the HFRC adjustment</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCKENSTAT</name>
          <description>Clock Enable Status</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CLOCKENSTAT</name>
              <description>Clock enable status</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_CLKEN</name>
                  <description>Clock enable for the ADC.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APBDMA_ACTIVITY_CLKEN</name>
                  <description>Clock enable for the APBDMA ACTIVITY</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APBDMA_AOH_CLKEN</name>
                  <description>Clock enable for the APBDMA AOH DOMAIN</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APBDMA_AOL_CLKEN</name>
                  <description>Clock enable for the APBDMA AOL DOMAIN</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APBDMA_APB_CLKEN</name>
                  <description>Clock enable for the APBDMA_APB</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APBDMA_BLEL_CLKEN</name>
                  <description>Clock enable for the APBDMA_BLEL</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APBDMA_HCPA_CLKEN</name>
                  <description>Clock enable for the APBDMA_HCPA</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APBDMA_HCPB_CLKEN</name>
                  <description>Clock enable for the APBDMA_HCPB</description>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APBDMA_HCPC_CLKEN</name>
                  <description>Clock enable for the APBDMA_HCPC</description>
                  <value>256</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APBDMA_MSPI_CLKEN</name>
                  <description>Clock enable for the APBDMA_MSPI</description>
                  <value>512</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APBDMA_MSPI1_CLKEN</name>
                  <description>Clock enable for the APBDMA_MSPI1</description>
                  <value>1024</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APBDMA_MSPI2_CLKEN</name>
                  <description>Clock enable for the APBDMA_MSPI2</description>
                  <value>2048</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APBDMA_PDM_CLKEN</name>
                  <description>Clock enable for the APBDMA_PDM</description>
                  <value>4096</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLEIF_CLK_CLKEN</name>
                  <description>Clock enable for the BLEIF</description>
                  <value>8192</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLEIF_CLK32K_CLKEN</name>
                  <description>Clock enable for the BLEIF 32khZ CLOCK</description>
                  <value>16384</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER_CLKEN</name>
                  <description>Clock enable for the CTIMER BLOCK</description>
                  <value>32768</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER0A_CLKEN</name>
                  <description>Clock enable for the CTIMER0A</description>
                  <value>65536</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER0B_CLKEN</name>
                  <description>Clock enable for the CTIMER0B</description>
                  <value>131072</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER1A_CLKEN</name>
                  <description>Clock enable for the CTIMER1A</description>
                  <value>262144</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER1B_CLKEN</name>
                  <description>Clock enable for the CTIMER1B</description>
                  <value>524288</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER2A_CLKEN</name>
                  <description>Clock enable for the CTIMER2A</description>
                  <value>1048576</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER2B_CLKEN</name>
                  <description>Clock enable for the CTIMER2B</description>
                  <value>2097152</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER3A_CLKEN</name>
                  <description>Clock enable for the CTIMER3A</description>
                  <value>4194304</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER3B_CLKEN</name>
                  <description>Clock enable for the CTIMER3B</description>
                  <value>8388608</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER4A_CLKEN</name>
                  <description>Clock enable for the CTIMER4A</description>
                  <value>16777216</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER4B_CLKEN</name>
                  <description>Clock enable for the CTIMER4B</description>
                  <value>33554432</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER5A_CLKEN</name>
                  <description>Clock enable for the CTIMER5A</description>
                  <value>67108864</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER5B_CLKEN</name>
                  <description>Clock enable for the CTIMER5B</description>
                  <value>134217728</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER6A_CLKEN</name>
                  <description>Clock enable for the CTIMER6A</description>
                  <value>268435456</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER6B_CLKEN</name>
                  <description>Clock enable for the CTIMER6B</description>
                  <value>536870912</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER7A_CLKEN</name>
                  <description>Clock enable for the CTIMER7A</description>
                  <value>1073741824</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTIMER7B_CLKEN</name>
                  <description>Clock enable for the CTIMER7B</description>
                  <value>2147483648</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCKEN2STAT</name>
          <description>Clock Enable Status</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CLOCKEN2STAT</name>
              <description>Clock enable status 2</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DAP_CLKEN</name>
                  <description>Clock enable for the DAP</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMSTRIFC0_CLKEN</name>
                  <description>Clock enable for the IO MASTER 0 IFC INTERFACE</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMSTRIFC1_CLKEN</name>
                  <description>Clock enable for the IO MASTER 1 IFC INTERFACE</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMSTRIFC2_CLKEN</name>
                  <description>Clock enable for the IO MASTER 2 IFC INTERFACE</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMSTRIFC3_CLKEN</name>
                  <description>Clock enable for the IO MASTER 3 IFC INTERFACE</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMSTRIFC4_CLKEN</name>
                  <description>Clock enable for the IO MASTER 4 IFC INTERFACE</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMSTRIFC5_CLKEN</name>
                  <description>Clock enable for the IO MASTER 5 IFC INTERFACE</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDM_CLKEN</name>
                  <description>Clock enable for the PDM</description>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDMIFC_CLKEN</name>
                  <description>Clock enable for the PDM INTERFACE</description>
                  <value>256</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWRCTRL_CLKEN</name>
                  <description>Clock enable for the PWRCTRL</description>
                  <value>512</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWRCTRL_COUNT_CLKEN</name>
                  <description>Clock enable for the PWRCTRL counter</description>
                  <value>1024</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSTGEN_CLKEN</name>
                  <description>Clock enable for the RSTGEN</description>
                  <value>2048</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCARD_CLKEN</name>
                  <description>Clock enable for the SCARD</description>
                  <value>4096</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCARD_ALTAPB_CLKEN</name>
                  <description>Clock enable for the SCARD ALTAPB</description>
                  <value>8192</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STIMER_CNT_CLKEN</name>
                  <description>Clock enable for the STIMER_CNT_CLKEN</description>
                  <value>16384</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TPIU_CLKEN</name>
                  <description>Clock enable for the TPIU_CLKEN</description>
                  <value>32768</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0HF_CLKEN</name>
                  <description>Clock enable for the UART0 HF</description>
                  <value>65536</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1HF_CLKEN</name>
                  <description>Clock enable for the UART1 HF</description>
                  <value>131072</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDT_CLKEN</name>
                  <description>Clock enable for the Watchdog timer</description>
                  <value>262144</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_32KHZ_EN</name>
                  <description>Clock enable for the XT 32KHZ</description>
                  <value>1073741824</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCEHFRC</name>
                  <description>HFRC is forced on Status.</description>
                  <value>2147483648</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCKEN3STAT</name>
          <description>Clock Enable Status</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CLOCKEN3STAT</name>
              <description>Clock enable status 3</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DAP_enabled</name>
                  <description>DAP clock is enabled [17]</description>
                  <value>131072</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VCOMP_enabled</name>
                  <description>VCOMP powerdown indicator [18]</description>
                  <value>262144</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_enabled</name>
                  <description>XTAL is enabled [24]</description>
                  <value>16777216</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_enabled</name>
                  <description>HFRC is enabled [25]</description>
                  <value>33554432</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFADJEN</name>
                  <description>HFRC Adjust enabled [26]</description>
                  <value>67108864</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_en_out</name>
                  <description>HFRC Enabled out [27]</description>
                  <value>134217728</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_XT</name>
                  <description>RTC use XT [28]</description>
                  <value>268435456</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clkout_xtal_en</name>
                  <description>XTAL clkout enabled [29]</description>
                  <value>536870912</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clkout_hfrc_en</name>
                  <description>HFRC clkout enabled [30]</description>
                  <value>1073741824</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>flashclk_en</name>
                  <description>Flash clk is enabled [31]</description>
                  <value>2147483648</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FREQCTRL</name>
          <description>HFRC Frequency Control register</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>BURSTSTATUS</name>
              <description>This represents frequency burst status.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

