sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
            <field>
              <name>TONLOWTHRESHOLD</name>
              <description>TON ADJUST LOW THRESHOLD.  Suggested values are #A(94KHz) #15(47KHz) #53(12Khz) #14D(3Khz)</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTRPTEN</name>
          <description>CLKGEN Interrupt Register: Enable</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>OF</name>
              <description>XT Oscillator Fail interrupt</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ACC</name>
              <description>Autocalibration Complete interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ACF</name>
              <description>Autocalibration Fail interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTRPTSTAT</name>
          <description>CLKGEN Interrupt Register: Status</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>OF</name>
              <description>XT Oscillator Fail interrupt</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ACC</name>
              <description>Autocalibration Complete interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ACF</name>
              <description>Autocalibration Fail interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTRPTCLR</name>
          <description>CLKGEN Interrupt Register: Clear</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>OF</name>
              <description>XT Oscillator Fail interrupt</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ACC</name>
              <description>Autocalibration Complete interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ACF</name>
              <description>Autocalibration Fail interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTRPTSET</name>
          <description>CLKGEN Interrupt Register: Set</description>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>OF</name>
              <description>XT Oscillator Fail interrupt</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ACC</name>
              <description>Autocalibration Complete interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ACF</name>
              <description>Autocalibration Fail interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>CTIMER</name>
      <version>1.0</version>
      <description>Counter/Timer</description>
      <!-- <groupName>GROUP_CTIMER</groupName> -->
      <baseAddress>0x40008000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000310</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CTIMER</name>
        <value>14</value>
      </interrupt>      <interrupt>
        <name>STIMER</name>
        <value>22</value>
      </interrupt>      <interrupt>
        <name>STIMER_CMPR0</name>
        <value>23</value>
      </interrupt>      <interrupt>
        <name>STIMER_CMPR1</name>
        <value>24</value>
      </interrupt>      <interrupt>
        <name>STIMER_CMPR2</name>
        <value>25</value>
      </interrupt>      <interrupt>
        <name>STIMER_CMPR3</name>
        <value>26</value>
      </interrupt>      <interrupt>
        <name>STIMER_CMPR4</name>
        <value>27</value>
      </interrupt>      <interrupt>
        <name>STIMER_CMPR5</name>
        <value>28</value>
      </interrupt>      <interrupt>
        <name>STIMER_CMPR6</name>
        <value>29</value>
      </interrupt>      <interrupt>
        <name>STIMER_CMPR7</name>
        <value>30</value>
      </interrupt>
      <registers>
        <register>
          <name>TMR0</name>
          <description>Counter/Timer Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CTTMRB0</name>
              <description>Counter/Timer B0.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

