sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
          </fields>
        </register>
        <register>
          <name>TMR5</name>
          <description>Counter/Timer Register</description>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CTTMRB5</name>
              <description>Counter/Timer B5.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTTMRA5</name>
              <description>Counter/Timer A5.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CMPRA5</name>
          <description>Counter/Timer A5 Compare Registers</description>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CMPR1A5</name>
              <description>Counter/Timer A5 Compare Register 1.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CMPR0A5</name>
              <description>Counter/Timer A5 Compare Register 0.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CMPRB5</name>
          <description>Counter/Timer B5 Compare Registers</description>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CMPR1B5</name>
              <description>Counter/Timer B5 Compare Register 1.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CMPR0B5</name>
              <description>Counter/Timer B5 Compare Register 0.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CTRL5</name>
          <description>Counter/Timer Control</description>
          <addressOffset>0x000000AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x9FFF1FFF</resetMask>

          <fields>
            <field>
              <name>CTLINK5</name>
              <description>Counter/Timer A5/B5 Link bit.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TWO_16BIT_TIMERS</name>
                  <description>Use A5/B5 timers as two independent 16-bit timers (default).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32BIT_TIMER</name>
                  <description>Link A5/B5 timers into a single 32-bit timer.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRB5POL</name>
              <description>Counter/Timer B5 output polarity.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>The polarity of the TMRPINB5 pin is the same as the timer output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED</name>
                  <description>The polarity of the TMRPINB5 pin is the inverse of the timer output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRB5CLR</name>
              <description>Counter/Timer B5 Clear bit.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RUN</name>
                  <description>Allow counter/timer B5 to run</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Holds counter/timer B5 at 0x0000.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRB5IE1</name>
              <description>Counter/Timer B5 Interrupt Enable bit for COMPR1.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable counter/timer B5 from generating an interrupt based on COMPR1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable counter/timer B5 to generate an interrupt based on COMPR1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRB5IE0</name>
              <description>Counter/Timer B5 Interrupt Enable bit for COMPR0.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable counter/timer B5 from generating an interrupt based on COMPR0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable counter/timer B5 to generate an interrupt based on COMPR0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRB5FN</name>
              <description>Counter/Timer B5 Function Select.</description>
              <bitRange>[24:22]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLECOUNT</name>
                  <description>Single count (output toggles and sticks).  Count to CMPR0B5, stop.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATEDCOUNT</name>
                  <description>Repeated count (periodic 1-clock-cycle-wide pulses).  Count to CMPR0B5, restart.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULSE_ONCE</name>
                  <description>Pulse once (aka one-shot).  Count to CMPR0B5, assert, count to CMPR1B5, deassert, stop.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULSE_CONT</name>
                  <description>Pulse continously.  Count to CMPR0B5, assert, count to CMPR1B5, deassert, restart.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLEPATTERN</name>
                  <description>Single pattern.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATPATTERN</name>
                  <description>Repeated pattern.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTINUOUS</name>
                  <description>Continuous run (aka Free Run).  Count continuously.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALTPWN</name>
                  <description>Alternate PWM</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRB5CLK</name>
              <description>Counter/Timer B5 Clock Select.</description>
              <bitRange>[21:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TMRPIN</name>
                  <description>Clock source is TMRPINB.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV4</name>
                  <description>Clock source is the HFRC / 4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV16</name>
                  <description>Clock source is HFRC / 16</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV256</name>
                  <description>Clock source is HFRC / 256</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV1024</name>
                  <description>Clock source is HFRC / 1024</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV4K</name>
                  <description>Clock source is HFRC / 4096</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT</name>
                  <description>Clock source is the XT (uncalibrated).</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV2</name>
                  <description>Clock source is XT / 2</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV16</name>
                  <description>Clock source is XT / 16</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV128</name>
                  <description>Clock source is XT / 128</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRC_DIV2</name>
                  <description>Clock source is LFRC / 2</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRC_DIV32</name>
                  <description>Clock source is LFRC / 32</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRC_DIV1K</name>
                  <description>Clock source is LFRC / 1024</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRC</name>
                  <description>Clock source is LFRC</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_100HZ</name>
                  <description>Clock source is 100 Hz from the current RTC oscillator.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HCLK_DIV4</name>
                  <description>Clock source is HCLK / 4 (note: this clock is only available when MCU is in active mode)</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV4</name>
                  <description>Clock source is XT / 4</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV8</name>
                  <description>Clock source is XT / 8</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT_DIV32</name>
                  <description>Clock source is XT / 32</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTMRA5</name>
                  <description>Clock source is CTIMERA5 OUT.</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTMRA0</name>
                  <description>Clock source is CTIMERA0 OUT.</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTMRB0</name>
                  <description>Clock source is CTIMERB0 OUT.</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTMRA6</name>
                  <description>Clock source is CTIMERA6 OUT.</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTMRB6</name>
                  <description>Clock source is CTIMERB6 OUT.</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTMRB1</name>
                  <description>Clock source is CTIMERB1 OUT.</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTMRB2</name>
                  <description>Clock source is CTIMERB2 OUT.</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTMRB3</name>
                  <description>Clock source is CTIMERB3 OUT.</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTMRB4</name>
                  <description>Clock source is CTIMERB4 OUT.</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUCKBLE</name>
                  <description>Clock source is BLE buck converter TON pulses.</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUCKB</name>
                  <description>Clock source is Memory buck converter TON pulses.</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUCKA</name>
                  <description>Clock source is CPU buck converter TON pulses.</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRB5EN</name>
              <description>Counter/Timer B5 Enable bit.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Counter/Timer B5 Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Counter/Timer B5 Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRA5POL</name>
              <description>Counter/Timer A5 output polarity.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>The polarity of the TMRPINA5 pin is the same as the timer output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED</name>
                  <description>The polarity of the TMRPINA5 pin is the inverse of the timer output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRA5CLR</name>
              <description>Counter/Timer A5 Clear bit.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RUN</name>
                  <description>Allow counter/timer A5 to run</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Holds counter/timer A5 at 0x0000.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRA5IE1</name>
              <description>Counter/Timer A5 Interrupt Enable bit based on COMPR1.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable counter/timer A5 from generating an interrupt based on COMPR1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable counter/timer A5 to generate an interrupt based on COMPR1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRA5IE0</name>
              <description>Counter/Timer A5 Interrupt Enable bit based on COMPR0.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable counter/timer A5 from generating an interrupt based on COMPR0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable counter/timer A5 to generate an interrupt based on COMPR0.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRA5FN</name>
              <description>Counter/Timer A5 Function Select.</description>
              <bitRange>[8:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLECOUNT</name>
                  <description>Single count (output toggles and sticks).  Count to CMPR0A5, stop.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATEDCOUNT</name>
                  <description>Repeated count (periodic 1-clock-cycle-wide pulses).  Count to CMPR0A5, restart.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULSE_ONCE</name>
                  <description>Pulse once (aka one-shot).  Count to CMPR0A5, assert, count to CMPR1A5, deassert, stop.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULSE_CONT</name>
                  <description>Pulse continously.  Count to CMPR0A5, assert, count to CMPR1A5, deassert, restart.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLEPATTERN</name>
                  <description>Single pattern.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATPATTERN</name>
                  <description>Repeated pattern.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTINUOUS</name>
                  <description>Continuous run (aka Free Run).  Count continuously.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALTPWN</name>
                  <description>Alternate PWM</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMRA5CLK</name>
              <description>Counter/Timer A5 Clock Select.</description>
              <bitRange>[5:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TMRPIN</name>
                  <description>Clock source is TMRPINA.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV4</name>
                  <description>Clock source is the HFRC / 4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV16</name>
                  <description>Clock source is HFRC / 16</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV256</name>
                  <description>Clock source is HFRC / 256</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV1024</name>
                  <description>Clock source is HFRC / 1024</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_DIV4K</name>
