sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
            <field>
              <name>CTMRB1C1INT</name>
              <description>Counter/Timer B1 interrupt based on COMPR1.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA1C1INT</name>
              <description>Counter/Timer A1 interrupt based on COMPR1.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB0C1INT</name>
              <description>Counter/Timer B0 interrupt based on COMPR1.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA0C1INT</name>
              <description>Counter/Timer A0 interrupt based on COMPR1.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB7C0INT</name>
              <description>Counter/Timer B7 interrupt based on COMPR0.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA7C0INT</name>
              <description>Counter/Timer A7 interrupt based on COMPR0.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB6C0INT</name>
              <description>Counter/Timer B6 interrupt based on COMPR0.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA6C0INT</name>
              <description>Counter/Timer A6 interrupt based on COMPR0.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB5C0INT</name>
              <description>Counter/Timer B5 interrupt based on COMPR0.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA5C0INT</name>
              <description>Counter/Timer A5 interrupt based on COMPR0.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB4C0INT</name>
              <description>Counter/Timer B4 interrupt based on COMPR0.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA4C0INT</name>
              <description>Counter/Timer A4 interrupt based on COMPR0.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB3C0INT</name>
              <description>Counter/Timer B3 interrupt based on COMPR0.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA3C0INT</name>
              <description>Counter/Timer A3 interrupt based on COMPR0.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB2C0INT</name>
              <description>Counter/Timer B2 interrupt based on COMPR0.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA2C0INT</name>
              <description>Counter/Timer A2 interrupt based on COMPR0.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB1C0INT</name>
              <description>Counter/Timer B1 interrupt based on COMPR0.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA1C0INT</name>
              <description>Counter/Timer A1 interrupt based on COMPR0.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRB0C0INT</name>
              <description>Counter/Timer B0 interrupt based on COMPR0.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTMRA0C0INT</name>
              <description>Counter/Timer A0 interrupt based on COMPR0.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>STMINTEN</name>
          <description>STIMER Interrupt registers: Enable</description>
          <addressOffset>0x00000300</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001FFF</resetMask>

          <fields>
            <field>
              <name>CAPTURED</name>
              <description>CAPTURE register D has grabbed the value in the counter</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPD_INT</name>
                  <description>Capture D interrupt status bit was set.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPTUREC</name>
              <description>CAPTURE register C has grabbed the value in the counter</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPC_INT</name>
                  <description>CAPTURE C interrupt status bit was set.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPTUREB</name>
              <description>CAPTURE register B has grabbed the value in the counter</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPB_INT</name>
                  <description>CAPTURE B interrupt status bit was set.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPTUREA</name>
              <description>CAPTURE register A has grabbed the value in the counter</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPA_INT</name>
                  <description>CAPTURE A interrupt status bit was set.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVERFLOW</name>
              <description>COUNTER over flowed from 0xFFFFFFFF back to 0x00000000.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFLOW_INT</name>
                  <description>Overflow interrupt status bit was set.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREH</name>
              <description>COUNTER is greater than or equal to COMPARE register H.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARED</name>
                  <description>COUNTER greater than or equal to COMPARE register.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREG</name>
              <description>COUNTER is greater than or equal to COMPARE register G.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARED</name>
                  <description>COUNTER greater than or equal to COMPARE register.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREF</name>
              <description>COUNTER is greater than or equal to COMPARE register F.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARED</name>
                  <description>COUNTER greater than or equal to COMPARE register.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREE</name>
              <description>COUNTER is greater than or equal to COMPARE register E.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARED</name>
                  <description>COUNTER greater than or equal to COMPARE register.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPARED</name>
              <description>COUNTER is greater than or equal to COMPARE register D.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARED</name>
                  <description>COUNTER greater than or equal to COMPARE register.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREC</name>
              <description>COUNTER is greater than or equal to COMPARE register C.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARED</name>
                  <description>COUNTER greater than or equal to COMPARE register.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREB</name>
              <description>COUNTER is greater than or equal to COMPARE register B.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARED</name>
                  <description>COUNTER greater than or equal to COMPARE register.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREA</name>
              <description>COUNTER is greater than or equal to COMPARE register A.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARED</name>
                  <description>COUNTER greater than or equal to COMPARE register.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STMINTSTAT</name>
          <description>STIMER Interrupt registers: Status</description>
          <addressOffset>0x00000304</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001FFF</resetMask>

          <fields>
            <field>
              <name>CAPTURED</name>
              <description>CAPTURE register D has grabbed the value in the counter</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPD_INT</name>
                  <description>Capture D interrupt status bit was set.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPTUREC</name>
              <description>CAPTURE register C has grabbed the value in the counter</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPC_INT</name>
                  <description>CAPTURE C interrupt status bit was set.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPTUREB</name>
              <description>CAPTURE register B has grabbed the value in the counter</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPB_INT</name>
                  <description>CAPTURE B interrupt status bit was set.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPTUREA</name>
              <description>CAPTURE register A has grabbed the value in the counter</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPA_INT</name>
                  <description>CAPTURE A interrupt status bit was set.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVERFLOW</name>
              <description>COUNTER over flowed from 0xFFFFFFFF back to 0x00000000.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFLOW_INT</name>
                  <description>Overflow interrupt status bit was set.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREH</name>
              <description>COUNTER is greater than or equal to COMPARE register H.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARED</name>
                  <description>COUNTER greater than or equal to COMPARE register.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREG</name>
              <description>COUNTER is greater than or equal to COMPARE register G.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARED</name>
                  <description>COUNTER greater than or equal to COMPARE register.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREF</name>
              <description>COUNTER is greater than or equal to COMPARE register F.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARED</name>
                  <description>COUNTER greater than or equal to COMPARE register.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREE</name>
              <description>COUNTER is greater than or equal to COMPARE register E.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARED</name>
                  <description>COUNTER greater than or equal to COMPARE register.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPARED</name>
              <description>COUNTER is greater than or equal to COMPARE register D.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARED</name>
                  <description>COUNTER greater than or equal to COMPARE register.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREC</name>
              <description>COUNTER is greater than or equal to COMPARE register C.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARED</name>
                  <description>COUNTER greater than or equal to COMPARE register.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREB</name>
              <description>COUNTER is greater than or equal to COMPARE register B.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARED</name>
                  <description>COUNTER greater than or equal to COMPARE register.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREA</name>
              <description>COUNTER is greater than or equal to COMPARE register A.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARED</name>
                  <description>COUNTER greater than or equal to COMPARE register.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STMINTCLR</name>
          <description>STIMER Interrupt registers: Clear</description>
          <addressOffset>0x00000308</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001FFF</resetMask>

