sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
          <fields>
            <field>
              <name>PAD15FNCSEL</name>
              <description>Pad 15 function select</description>
              <bitRange>[29:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCD1N</name>
                  <description>Configure as the analog ADC differential pair 1 N input signal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NCE15</name>
                  <description>IOM/MSPI nCE group 15</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1RX</name>
                  <description>Configure as the UART1 RX signal</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO15</name>
                  <description>Configure as GPIO15</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDMDATA</name>
                  <description>PDM serial data input</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXT</name>
                  <description>Configure as the external XTAL oscillator input</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWDIO</name>
                  <description>Configure as an alternate port for the SWDIO I/O signal</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWO</name>
                  <description>Configure as an SWO (Serial Wire Trace output)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD15STRNG</name>
              <description>Pad 15 drive strength</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD15INPEN</name>
              <description>Pad 15 input enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD15PULL</name>
              <description>Pad 15 pullup enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD14FNCSEL</name>
              <description>Pad 14 function select</description>
              <bitRange>[21:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCD1P</name>
                  <description>Configure as the analog ADC differential pair 1 P input signal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NCE14</name>
                  <description>IOM/MSPI nCE group 14</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1TX</name>
                  <description>Configure as the UART1 TX output signal</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO14</name>
                  <description>Configure as GPIO14</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDMCLK</name>
                  <description>PDM serial clock output</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTHFS</name>
                  <description>Configure as the External HFRC oscillator input select</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWDCK</name>
                  <description>Configure as the alternate input for the SWDCK input signal</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32kHzXT</name>
                  <description>Configure as the 32kHz crystal output signal</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD14STRNG</name>
              <description>Pad 14 drive strength</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD14INPEN</name>
              <description>Pad 14 input enable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD14PULL</name>
              <description>Pad 14 pullup enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD13FNCSEL</name>
              <description>Pad 13 function select</description>
              <bitRange>[13:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCD0PSE8</name>
                  <description>Configure as the ADC Differential pair 0 P, or Single Ended input 8 analog input signal. Determination of the D0P vs SE8 usage is done when the particular channel is selected within the ADC module</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NCE13</name>
                  <description>IOM/MSPI nCE group 13</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT2</name>
                  <description>CTIMER connection 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO13</name>
                  <description>Configure as GPIO13</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2SBCLK</name>
                  <description>I2C interface bit clock</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTHFB</name>
                  <description>Configure as the external HFRC oscillator input</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UA0RTS</name>
                  <description>Configure as the UART0 RTS signal output</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1RX</name>
                  <description>Configure as the UART1 RX input signal</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD13STRNG</name>
              <description>Pad 13 drive strength</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD13INPEN</name>
              <description>Pad 13 input enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD13PULL</name>
              <description>Pad 13 pullup enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD12FNCSEL</name>
              <description>Pad 12 function select</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCD0NSE9</name>
                  <description>Configure as the ADC Differential pair 0 N, or Single Ended input 9 analog input signal. Determination of the D0N vs SE9 usage is done when the particular channel is selected within the ADC module</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NCE12</name>
                  <description>IOM/MSPI nCE group 12</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT0</name>
                  <description>CTIMER connection 0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO12</name>
                  <description>Configure as GPIO12</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLnCE</name>
                  <description>Configure as the IOSLAVE SPI nCE signal</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDMCLK</name>
                  <description>PDM serial clock output</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UA0CTS</name>
                  <description>Configure as the UART0 CTS input signal</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1TX</name>
                  <description>Configure as the UART1 TX output signal</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD12STRNG</name>
              <description>Pad 12 drive strength</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD12INPEN</name>
              <description>Pad 12 input enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD12PULL</name>
              <description>Pad 12 pullup enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PADREGE</name>
          <description>Pad Configuration Register E (Pads 16-19)</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x18181818</resetValue>
          <resetMask>0x3F3F3F3F</resetMask>

