sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
          <fields>
            <field>
              <name>PAD23FNCSEL</name>
              <description>Pad 23 function select</description>
              <bitRange>[29:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART0RX</name>
                  <description>Configure as the UART0 RX signal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NCE23</name>
                  <description>IOM/MSPI nCE group 23</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT14</name>
                  <description>CTIMER connection 14</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO23</name>
                  <description>Configure as GPIO23</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2SWCLK</name>
                  <description>I2S word clock input</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMPOUT</name>
                  <description>Configure as voltage comparitor output</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSPI3</name>
                  <description>MSPI data connection 3</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXT</name>
                  <description>External XTAL osacillatgor input</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD23STRNG</name>
              <description>Pad 23 drive strength</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD23INPEN</name>
              <description>Pad 23 input enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD23PULL</name>
              <description>Pad 23 pullup enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD22FNCSEL</name>
              <description>Pad 22 function select</description>
              <bitRange>[21:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART0TX</name>
                  <description>Configure as the UART0 TX signal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NCE22</name>
                  <description>IOM/MSPI nCE group 22</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT12</name>
                  <description>CTIMER connection 12</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO22</name>
                  <description>Configure as GPIO22</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDM_CLK</name>
                  <description>Configure as the PDM CLK output</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLF</name>
                  <description>External LFRC input</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSPI0</name>
                  <description>MSPI data connection 0</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWO</name>
                  <description>Configure as the serial trace data output signal</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD22STRNG</name>
              <description>Pad 22 drive strength</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD22INPEN</name>
              <description>Pad 22 input enable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD22PULL</name>
              <description>Pad 22 pullup enable</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD21FNCSEL</name>
              <description>Pad 21 function select</description>
              <bitRange>[13:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWDIO</name>
                  <description>Configure as the serial wire debug data signal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NCE21</name>
                  <description>IOM/MSPI nCE group 21</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO21</name>
                  <description>Configure as GPIO21</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0RX</name>
                  <description>Configure as UART0 RX input signal</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1RX</name>
                  <description>Configure as UART1 RX input signal</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2SBCLK</name>
                  <description>I2S byte clock input</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UA1CTS</name>
                  <description>Configure as UART1 CTS input signal</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD21STRNG</name>
              <description>Pad 21 drive strength</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD21INPEN</name>
              <description>Pad 21 input enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD21PULL</name>
              <description>Pad 21 pullup enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pullup disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pullup enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD20FNCSEL</name>
              <description>Pad 20 function select</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWDCK</name>
                  <description>Configure as the serial wire debug clock signal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NCE20</name>
                  <description>IOM/MSPI nCE group 20</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO20</name>
                  <description>Configure as GPIO20</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0TX</name>
                  <description>Configure as UART0 TX output signal</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1TX</name>
                  <description>Configure as UART1 TX output signal</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2SBCLK</name>
                  <description>I2S byte clock input</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UA1RTS</name>
                  <description>Configure as UART1 RTS output signal</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD20STRNG</name>
              <description>Pad 20 drive strength</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low drive strength</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High drive strength</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD20INPEN</name>
              <description>Pad 20 input enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pad input disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pad input enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD20PULL</name>
              <description>Pad 20 pulldown enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Pulldown disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Pulldown enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PADREGG</name>
          <description>Pad Configuration Register G (Pads 24-27)</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x18181818</resetValue>
          <resetMask>0xFF3FFF3F</resetMask>

