sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
          <fields>
            <field>
              <name>GPIO63INTD</name>
              <description>GPIO63 interrupt direction, nCE polarity.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>Applies when PAD63FNCSEL = NCE63 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>Applies when PAD63FNCSEL = NCE63 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO63OUTCFG</name>
              <description>GPIO63 output configuration.</description>
              <bitRange>[30:29]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Applies when PAD63FNCSEL = GPIO - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Applies when PAD63FNCSEL = GPIO - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>Applies when PAD63FNCSEL = GPIO - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>Applies when PAD63FNCSEL = GPIO - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO63INCFG</name>
              <description>GPIO63 input enable.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Readback will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO62INTD</name>
              <description>GPIO62 interrupt direction, nCE polarity.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>Applies when PAD62FNCSEL = NCE62 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>Applies when PAD62FNCSEL = NCE62 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO62OUTCFG</name>
              <description>GPIO62 output configuration.</description>
              <bitRange>[26:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Applies when PAD62FNCSEL = GPIO - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Applies when PAD62FNCSEL = GPIO - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>Applies when PAD62FNCSEL = GPIO - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>Applies when PAD62FNCSEL = GPIO - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO62INCFG</name>
              <description>GPIO62 input enable.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Readback will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO61INTD</name>
              <description>GPIO61 interrupt direction, nCE polarity.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>Applies when PAD61FNCSEL = NCE61 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>Applies when PAD61FNCSEL = NCE61 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO61OUTCFG</name>
              <description>GPIO61 output configuration.</description>
              <bitRange>[22:21]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Applies when PAD61FNCSEL = GPIO - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Applies when PAD61FNCSEL = GPIO - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>Applies when PAD61FNCSEL = GPIO - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>Applies when PAD61FNCSEL = GPIO - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO61INCFG</name>
              <description>GPIO61 input enable.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Readback will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO60INTD</name>
              <description>GPIO60 interrupt direction, nCE polarity.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>Applies when PAD60FNCSEL = NCE60 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>Applies when PAD60FNCSEL = NCE60 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO60OUTCFG</name>
              <description>GPIO60 output configuration.</description>
              <bitRange>[18:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Applies when PAD60FNCSEL = GPIO - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Applies when PAD60FNCSEL = GPIO - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>Applies when PAD60FNCSEL = GPIO - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>Applies when PAD60FNCSEL = GPIO - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO60INCFG</name>
              <description>GPIO60 input enable.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Readback will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO59INTD</name>
              <description>GPIO59 interrupt direction, nCE polarity.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>Applies when PAD59FNCSEL = NCE59 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>Applies when PAD59FNCSEL = NCE59 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO59OUTCFG</name>
              <description>GPIO59 output configuration.</description>
              <bitRange>[14:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Applies when PAD59FNCSEL = GPIO - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Applies when PAD59FNCSEL = GPIO - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>Applies when PAD59FNCSEL = GPIO - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>Applies when PAD59FNCSEL = GPIO - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO59INCFG</name>
              <description>GPIO59 input enable.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Readback will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO58INTD</name>
              <description>GPIO58 interrupt direction, nCE polarity.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>Applies when PAD58FNCSEL = NCE58 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>Applies when PAD58FNCSEL = NCE58 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO58OUTCFG</name>
              <description>GPIO58 output configuration.</description>
              <bitRange>[10:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Applies when PAD58FNCSEL = GPIO - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Applies when PAD58FNCSEL = GPIO - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>Applies when PAD58FNCSEL = GPIO - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>Applies when PAD58FNCSEL = GPIO - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO58INCFG</name>
              <description>GPIO58 input enable.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Readback will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO57INTD</name>
              <description>GPIO57 interrupt direction, nCE polarity.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>Applies when PAD57FNCSEL = NCE57 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>Applies when PAD57FNCSEL = NCE57 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO57OUTCFG</name>
              <description>GPIO57 output configuration.</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Applies when PAD57FNCSEL = GPIO - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Applies when PAD57FNCSEL = GPIO - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>Applies when PAD57FNCSEL = GPIO - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>Applies when PAD57FNCSEL = GPIO - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO57INCFG</name>
              <description>GPIO57 input enable.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Readback will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO56INTD</name>
              <description>GPIO56 interrupt direction, nCE polarity.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nCELOW</name>
                  <description>Applies when PAD56FNCSEL = NCE56 - nCE polarity active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nCEHIGH</name>
                  <description>Applies when PAD56FNCSEL = NCE56 - nCE polarity active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO56OUTCFG</name>
              <description>GPIO56 output configuration.</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Applies when PAD56FNCSEL = GPIO - Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Applies when PAD56FNCSEL = GPIO - Output is push-pull</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>Applies when PAD56FNCSEL = GPIO - Output is open drain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>Applies when PAD56FNCSEL = GPIO - Output is tri-state</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO56INCFG</name>
              <description>GPIO56 input enable.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read the GPIO pin data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDZERO</name>
                  <description>INTD = 0 - Readback will always be zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGI</name>
          <description>GPIO Configuration Register I (Pads 71-64)</description>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

