sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
            <field>
              <name>STPOL2</name>
              <description>STIMER Capture 2 Polarity.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPLH</name>
                  <description>Capture on low to high GPIO transition</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPHL</name>
                  <description>Capture on high to low GPIO transition</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STSEL2</name>
              <description>STIMER Capture 2 Select.</description>
              <bitRange>[22:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STPOL1</name>
              <description>STIMER Capture 1 Polarity.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPLH</name>
                  <description>Capture on low to high GPIO transition</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPHL</name>
                  <description>Capture on high to low GPIO transition</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STSEL1</name>
              <description>STIMER Capture 1 Select.</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STPOL0</name>
              <description>STIMER Capture 0 Polarity.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPLH</name>
                  <description>Capture on low to high GPIO transition</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPHL</name>
                  <description>Capture on high to low GPIO transition</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STSEL0</name>
              <description>STIMER Capture 0 Select.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IOM0IRQ</name>
          <description>IOM0 Flow Control IRQ Select</description>
          <addressOffset>0x000000D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000007F</resetValue>
          <resetMask>0x0000007F</resetMask>

          <fields>
            <field>
              <name>IOM0IRQ</name>
              <description>IOMSTR0 IRQ pad select.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IOM1IRQ</name>
          <description>IOM1 Flow Control IRQ Select</description>
          <addressOffset>0x000000DC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000007F</resetValue>
          <resetMask>0x0000007F</resetMask>

          <fields>
            <field>
              <name>IOM1IRQ</name>
              <description>IOMSTR1 IRQ pad select.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IOM2IRQ</name>
          <description>IOM2 Flow Control IRQ Select</description>
          <addressOffset>0x000000E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000007F</resetValue>
          <resetMask>0x0000007F</resetMask>

          <fields>
            <field>
              <name>IOM2IRQ</name>
              <description>IOMSTR2 IRQ pad select.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IOM3IRQ</name>
          <description>IOM3 Flow Control IRQ Select</description>
          <addressOffset>0x000000E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000007F</resetValue>
          <resetMask>0x0000007F</resetMask>

          <fields>
            <field>
              <name>IOM3IRQ</name>
              <description>IOMSTR3 IRQ pad select.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IOM4IRQ</name>
          <description>IOM4 Flow Control IRQ Select</description>
          <addressOffset>0x000000E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0x0000007F</resetMask>

          <fields>
            <field>
              <name>IOM4IRQ</name>
              <description>IOMSTR4 IRQ pad select.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IOM5IRQ</name>
          <description>IOM5 Flow Control IRQ Select</description>
          <addressOffset>0x000000EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000007F</resetValue>
          <resetMask>0x0000007F</resetMask>

          <fields>
            <field>
              <name>IOM5IRQ</name>
              <description>IOMSTR5 IRQ pad select.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>

