sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
            <field>
              <name>PAD25_SR</name>
              <description>Pad 27 slew rate selection.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_EN</name>
                  <description>Enables Slew rate control on pad</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD25_DS1</name>
              <description>Pad 25 high order drive strength selection.  Used in conjunction with PAD25STRNG field to set the pad drive strength.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PAD24_SR</name>
              <description>Pad 27 slew rate selection.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_EN</name>
                  <description>Enables Slew rate control on pad</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD24_DS1</name>
              <description>Pad 24 high order drive strength selection.  Used in conjunction with PAD24STRNG field to set the pad drive strength.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ALTPADCFGH</name>
          <description>Alternate Pad Configuration reg0 (Pads 31-28)</description>
          <addressOffset>0x00000114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x11111111</resetMask>

          <fields>
            <field>
              <name>PAD31_SR</name>
              <description>Pad 31 slew rate selection.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_EN</name>
                  <description>Enables Slew rate control on pad</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD31_DS1</name>
              <description>Pad 31 high order drive strength selection.  Used in conjunction with PAD31STRNG field to set the pad drive strength.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PAD30_SR</name>
              <description>Pad 31 slew rate selection.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_EN</name>
                  <description>Enables Slew rate control on pad</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD30_DS1</name>
              <description>Pad 30 high order drive strength selection.  Used in conjunction with PAD30STRNG field to set the pad drive strength.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PAD29_SR</name>
              <description>Pad 31 slew rate selection.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_EN</name>
                  <description>Enables Slew rate control on pad</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD29_DS1</name>
              <description>Pad 29 high order drive strength selection.  Used in conjunction with PAD29STRNG field to set the pad drive strength.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PAD28_SR</name>
              <description>Pad 31 slew rate selection.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_EN</name>
                  <description>Enables Slew rate control on pad</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD28_DS1</name>
              <description>Pad 28 high order drive strength selection.  Used in conjunction with PAD28STRNG field to set the pad drive strength.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ALTPADCFGI</name>
          <description>Alternate Pad Configuration reg0 (Pads 35-32)</description>
          <addressOffset>0x00000118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x11111111</resetMask>

          <fields>
            <field>
              <name>PAD35_SR</name>
              <description>Pad 35 slew rate selection.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_EN</name>
                  <description>Enables Slew rate control on pad</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD35_DS1</name>
              <description>Pad 35 high order drive strength selection.  Used in conjunction with PAD35STRNG field to set the pad drive strength.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

