sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
            <field>
              <name>PAD53_SR</name>
              <description>Pad 55 slew rate selection.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_EN</name>
                  <description>Enables Slew rate control on pad</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD53_DS1</name>
              <description>Pad 53 high order drive strength selection.  Used in conjunction with PAD53STRNG field to set the pad drive strength.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PAD52_SR</name>
              <description>Pad 55 slew rate selection.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_EN</name>
                  <description>Enables Slew rate control on pad</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD52_DS1</name>
              <description>Pad 52 high order drive strength selection.  Used in conjunction with PAD52STRNG field to set the pad drive strength.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ALTPADCFGO</name>
          <description>Alternate Pad Configuration reg0 (Pads 59-56)</description>
          <addressOffset>0x00000130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x11111111</resetMask>

          <fields>
            <field>
              <name>PAD59_SR</name>
              <description>Pad 59 slew rate selection.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_EN</name>
                  <description>Enables Slew rate control on pad</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD59_DS1</name>
              <description>Pad 59 high order drive strength selection.  Used in conjunction with PAD59STRNG field to set the pad drive strength.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PAD58_SR</name>
              <description>Pad 59 slew rate selection.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_EN</name>
                  <description>Enables Slew rate control on pad</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD58_DS1</name>
              <description>Pad 58 high order drive strength selection.  Used in conjunction with PAD58STRNG field to set the pad drive strength.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PAD57_SR</name>
              <description>Pad 59 slew rate selection.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_EN</name>
                  <description>Enables Slew rate control on pad</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD57_DS1</name>
              <description>Pad 57 high order drive strength selection.  Used in conjunction with PAD57STRNG field to set the pad drive strength.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PAD56_SR</name>
              <description>Pad 59 slew rate selection.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_EN</name>
                  <description>Enables Slew rate control on pad</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD56_DS1</name>
              <description>Pad 56 high order drive strength selection.  Used in conjunction with PAD56STRNG field to set the pad drive strength.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ALTPADCFGP</name>
          <description>Alternate Pad Configuration reg0 (Pads 63-60)</description>
          <addressOffset>0x00000134</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x11111111</resetMask>

          <fields>
            <field>
              <name>PAD63_SR</name>
              <description>Pad 63 slew rate selection.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SR_EN</name>
                  <description>Enables Slew rate control on pad</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD63_DS1</name>
              <description>Pad 63 high order drive strength selection.  Used in conjunction with PAD63STRNG field to set the pad drive strength.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

