sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
            <field>
              <name>GPIO62</name>
              <description>GPIO62 interrupt.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO61</name>
              <description>GPIO61 interrupt.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO60</name>
              <description>GPIO60 interrupt.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO59</name>
              <description>GPIO59 interrupt.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO58</name>
              <description>GPIO58 interrupt.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO57</name>
              <description>GPIO57 interrupt.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO56</name>
              <description>GPIO56 interrupt.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO55</name>
              <description>GPIO55 interrupt.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO54</name>
              <description>GPIO54 interrupt.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO53</name>
              <description>GPIO53 interrupt.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO52</name>
              <description>GPIO52 interrupt.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO51</name>
              <description>GPIO51 interrupt.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO50</name>
              <description>GPIO50 interrupt.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO49</name>
              <description>GPIO49 interrupt.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO48</name>
              <description>GPIO48 interrupt.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO47</name>
              <description>GPIO47 interrupt.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO46</name>
              <description>GPIO46 interrupt.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO45</name>
              <description>GPIO45 interrupt.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO44</name>
              <description>GPIO44 interrupt.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO43</name>
              <description>GPIO43 interrupt.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO42</name>
              <description>GPIO42 interrupt.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO41</name>
              <description>GPIO41 interrupt.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO40</name>
              <description>GPIO40 interrupt.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO39</name>
              <description>GPIO39 interrupt.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO38</name>
              <description>GPIO38 interrupt.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO37</name>
              <description>GPIO37 interrupt.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO36</name>
              <description>GPIO36 interrupt.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GPIO35</name>
              <description>GPIO35 interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

