sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
            <field>
              <name>FIFORTHR</name>
              <description>FIFO read threshold in bytes.  A value of 0 will disable the read FIFO level from activating the threshold interrupt. If this field is non-zero, it will trigger a threshold interrupt when the read fifo contains FIFORTHR valid bytes of data, as indicated by the FIFO1SIZ field.  This is intended to signal when a data transfer of FIFORTHR bytes can be done from the IOM module to the host via the read fifo to support large IOM read operations.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFOPOP</name>
          <description>FIFO POP register</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FIFODOUT</name>
              <description>This register will return the read data indicated by the current read pointer on reads. If the POPWR control bit in the FIFOCTRL register is reset (0), the fifo read pointer will be advanced by one word as a result of the read.
If the POPWR bit is set (1), the fifo read pointer will only be advanced after a write operation to this register.  The write data is ignored for this register.
If less than a even word multiple is available, and the command is completed, the module will return the word containing these bytes and undetermined data in the unused fields of the word.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFOPUSH</name>
          <description>FIFO PUSH register</description>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FIFODIN</name>
              <description>This register is used to write the FIFORAM in FIFO mode and will cause a push event to occur to the next open slot within the FIFORAM.  Writing to this register will cause the write point to increment by 1 word(4 bytes).</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFOCTRL</name>
          <description>FIFO Control Register</description>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>FIFORSTN</name>
              <description>Active low manual reset of the fifo.  Write to 0 to reset fifo, and then write to 1 to remove the reset.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>POPWR</name>
              <description>Selects the mode in which 'pop' events are done for the fifo read operations.  A value of '1' will prevent a pop event on a read operation, and will require a write to the FIFOPOP register to create a pop event.
A value of '0' in this register will allow a pop event to occur on the read of the FIFOPOP register, and may cause inadvertant fifo pops when used in a debugging mode.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFOLOC</name>
          <description>FIFO Pointers</description>
          <addressOffset>0x00000114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000F0F</resetMask>

          <fields>
            <field>
              <name>FIFORPTR</name>
              <description>Current FIFO read pointer.  Used to index into the incoming FIFO (FIFO1), which is used to store read data returned from external devices during a read operation.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIFOWPTR</name>
              <description>Current FIFO write pointer. Value is the index into the outgoing FIFO (FIFO0), which is used during write operations to external devices.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>IO Master Interrupts: Enable</description>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00007FFF</resetMask>

          <fields>
            <field>
              <name>CQERR</name>
              <description>Error during command queue operations</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CQUPD</name>
              <description>CQ write operation performed a register write with the register address bit 0 set to 1.  The low address bits in the CQ address fields are unused and bit 0 can be used to trigger an interrupt to indicate when this register write is performed by the CQ operation.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

