sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
            <field>
              <name>CMD</name>
              <description>Command for submodule.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITE</name>
                  <description>Write command using count of offset bytes specified in the OFFSETCNT field</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read command using count of offset bytes specified in the OFFSETCNT field</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMW</name>
                  <description>SPI only. Test mode to do constant write operations. Useful for debug and power measurements. Will continually send data in OFFSET field</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR</name>
                  <description>SPI Only. Test mode to do constant read operations. Useful for debug and power measurements. Will continually read data from external input</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCX</name>
          <description>DCX Control Register</description>
          <addressOffset>0x0000021C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>

          <fields>
            <field>
              <name>DCXEN</name>
              <description>DCX Signaling Enable The selected DCX signal (unused CE pin) will be driven low during write of offset byte, and high during transmission of data bytes.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable DCX.</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable DCX.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CE3OUT</name>
              <description>Enable DCX output using CE3 output</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CE2OUT</name>
              <description>Enable DCX output using CE2 output</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CE1OUT</name>
              <description>Enable DCX output using CE1 output</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CE0OUT</name>
              <description>Enable DCX output using CE0 output</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>OFFSETHI</name>
          <description>High order 2 bytes of 3 byte offset for IO transaction</description>
          <addressOffset>0x00000220</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>OFFSETHI</name>
              <description>Holds the high order 2 bytes of the 3 byte addressing/offset field to use with IO commands.  The number of offset bytes to use is specified in the command register</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CMDSTAT</name>
          <description>Command status</description>
          <addressOffset>0x00000224</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>

          <fields>
            <field>
              <name>CTSIZE</name>
              <description>The current number of bytes still to be transferred with this command.  This field will count down to zero.</description>
              <bitRange>[19:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CMDSTAT</name>
              <description>The current status of the command execution.</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERR</name>
                  <description>Error encountered with command</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Actively processing command</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>Idle state, no active command, no error</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT</name>
                  <description>Command in progress, but waiting on data from host</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCMD</name>
              <description>current command that is being executed</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>

