sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
          </fields>
        </register>
        <register>
          <name>DMATARGADDR</name>
          <description>DMA Target Address Register</description>
          <addressOffset>0x0000028C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x101FFFFF</resetMask>

          <fields>
            <field>
              <name>TARGADDR28</name>
              <description>Bit 28 of the target byte address for source of DMA (either read or write). In cases of non-word aligned addresses, the DMA logic will take care for ensuring only the target bytes are read/written.
Setting to '1' will select the SRAM.  Setting to '0' will select the flash</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TARGADDR</name>
              <description>Bits [19:0] of the target byte address for source of DMA (either read or write). The address can be any byte alignment, and does not have to be word aligned.  In cases of non-word aligned addresses, the DMA logic will take care for ensuring only the target bytes are read/written.</description>
              <bitRange>[20:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMASTAT</name>
          <description>DMA Status Register</description>
          <addressOffset>0x00000290</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>DMAERR</name>
              <description>DMA Error. This active high bit signals an error was encountered during the DMA operation. The bit can be cleared by writing to 0.  Once set, this bit will remain set until cleared by software.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DMACPL</name>
              <description>DMA Transfer Complete. This signals the end of the DMA operation.  This bit can be cleared by writing to 0, and will also be cleared when a new DMA is started.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DMATIP</name>
              <description>DMA Transfer In Progress indicator.  1 will indicate that a DMA transfer is active.  The DMA transfer may be waiting on data, transferring data, or waiting for priority.
All of these will be indicated with a 1.  A 0 will indicate that the DMA is fully complete and no further transactions will be done.  This bit is read only.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CQCFG</name>
          <description>Command Queue Configuration Register</description>
          <addressOffset>0x00000294</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>

          <fields>
            <field>
              <name>MSPIFLGSEL</name>
              <description>Selects the MPSI modules used for sourcing the CQFLAG [11:8].</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MSPI0FLGSEL</name>
                  <description>Selects MPSI0 as source of signals used in CGFLAG[11:8].</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSPI1FLGSEL</name>
                  <description>Selects MPSI1 as source of signals used in CGFLAG[11:8].</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSPI2FLGSEL</name>
                  <description>Selects MPSI2 as source of signals used in CGFLAG[11:8].</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CQPRI</name>
              <description>Sets the Priority of the command queue dma request</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low Priority (service as best effort)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High Priority (service immediately)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CQEN</name>
              <description>Command queue enable. When set, will enable the processing of the command queue and fetches of address/data pairs will proceed from the word address within the CQADDR register.  Can be disabled using a CQ executed write to this bit as well.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable CQ Function</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable CQ Function</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CQADDR</name>
          <description>CQ Target Read Address Register</description>
          <addressOffset>0x00000298</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x101FFFFC</resetMask>

          <fields>
            <field>
              <name>CQADDR28</name>
              <description>Bit 28 of target byte address for source of CQ.  Used to denote Flash (0) or SRAM (1) access</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

