sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
            <field>
              <name>FUNDFL</name>
              <description>FIFO Underflow interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FOVFL</name>
              <description>FIFO Overflow interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FSIZE</name>
              <description>FIFO Size interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REGACCINTEN</name>
          <description>Register Access Interrupts: Enable</description>
          <addressOffset>0x00000210</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>REGACC</name>
              <description>Register access interrupts.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REGACCINTSTAT</name>
          <description>Register Access Interrupts: Status</description>
          <addressOffset>0x00000214</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>REGACC</name>
              <description>Register access interrupts.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REGACCINTCLR</name>
          <description>Register Access Interrupts: Clear</description>
          <addressOffset>0x00000218</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>REGACC</name>
              <description>Register access interrupts.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REGACCINTSET</name>
          <description>Register Access Interrupts: Set</description>
          <addressOffset>0x0000021C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>REGACC</name>
              <description>Register access interrupts.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>MCUCTRL</name>
      <version>1.0</version>
      <description>MCU Miscellaneous Control Logic</description>
      <!-- <groupName>GROUP_MCUCTRL</groupName> -->
      <baseAddress>0x40020000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x000003DC</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>BROWNOUT</name>
        <value>0</value>
      </interrupt>
      <registers>
        <register>
          <name>CHIPPN</name>
          <description>Chip Information Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x06000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>PARTNUM</name>
              <description>BCD part number.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>APOLLO3</name>
                  <description>Apollo3 part number is 0x06xxxxxx.</description>
                  <value>100663296</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APOLLO2</name>
                  <description>Apollo2 part number is 0x03xxxxxx.</description>
                  <value>50331648</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APOLLO</name>
                  <description>Apollo part number is 0x01xxxxxx.</description>
                  <value>16777216</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PN_M</name>
                  <description>Mask for the part number field.</description>
                  <value>4278190080</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PN_S</name>
                  <description>Bit position for the part number field.</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASHSIZE_M</name>
                  <description>Mask for the FLASH_SIZE field.
Values:
0: 16KB
1: 32KB
2: 64KB
3: 128KB
4: 256KB
5: 512KB
6: 1MB
7: 2MB
8: 1.5MB</description>
                  <value>15728640</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASHSIZE_S</name>
                  <description>Bit position for the FLASH_SIZE field.</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAMSIZE_M</name>
                  <description>Mask for the SRAM_SIZE field.
Values:
0: 16KB
1: 32KB
2: 64KB
3: 128KB
4: 256KB
5: 512KB
6: 1MB
7: 384KB
8: 768KB</description>
                  <value>983040</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAMSIZE_S</name>
                  <description>Bit position for the SRAM_SIZE field.</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REV_M</name>
                  <description>Mask for the revision field. Bits [15:12] are major rev, [11:8] are minor rev.
Values:
0: Major Rev A, Minor Rev 0
1: Major Rev B, Minor Rev 1</description>
                  <value>65280</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REV_S</name>
                  <description>Bit position for the revision field.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PKG_M</name>
                  <description>Mask for the package field.
Values:
0: SIP
1: QFN
2: BGA
3: CSP</description>
                  <value>192</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PKG_S</name>
                  <description>Bit position for the package field.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PINS_M</name>
                  <description>Mask for the pins field.
Values:
0: 25 pins
1: 49 pins
2: 64 pins
3: 81 pins</description>
                  <value>56</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PINS_S</name>
                  <description>Bit position for the pins field.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEMP_S</name>
                  <description>Bit position for the temperature field.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAL_S</name>
                  <description>Bit position for the qualified field.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPID0</name>
          <description>Unique Chip ID 0</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CHIPID0</name>
              <description>Unique chip ID 0.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>APOLLO3</name>
                  <description>Apollo3 CHIPID0.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPID1</name>
          <description>Unique Chip ID 1</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CHIPID1</name>
              <description>Unique chip ID 1.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>APOLLO3</name>
                  <description>Apollo3 CHIPID1.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPREV</name>
          <description>Chip Revision</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x000FFFFF</resetMask>

          <fields>
            <field>
              <name>SIPART</name>
              <description>Silicon Part ID</description>
              <bitRange>[19:8]</bitRange>
              <access>read-write</access>

