sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
            <field>
              <name>REVMAJ</name>
              <description>Major Revision ID.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>C</name>
                  <description>Apollo3 revision C</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>Apollo3 revision B</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <description>Apollo3 revision A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REVMIN</name>
              <description>Minor Revision ID.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REV1</name>
                  <description>Apollo3 minor rev 1.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REV0</name>
                  <description>Apollo3 minor rev 0.  Minor revision value, succeeding minor revisions will increment from this value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VENDORID</name>
          <description>Unique Vendor ID</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>VENDORID</name>
              <description>Unique Vendor ID</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AMBIQ</name>
                  <description>Ambiq Vendor ID 'AMBQ'</description>
                  <value>1095582289</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SKU</name>
          <description>Unique Chip SKU</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>SECBOOT</name>
              <description>Secure boot feature allowed</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ALLOWBLE</name>
              <description>Allow BLE feature</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ALLOWBURST</name>
              <description>Allow Burst feature</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FEATUREENABLE</name>
          <description>Feature Enable on Burst and BLE</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000077</resetMask>

          <fields>
            <field>
              <name>BURSTAVAIL</name>
              <description>Availability of Burst functionality</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AVAIL</name>
                  <description>Burst functionality available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTAVAIL</name>
                  <description>Burst functionality not available</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BURSTACK</name>
              <description>ACK for BURSTREQ</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BURSTREQ</name>
              <description>Controls the Burst functionality</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable the Burst functionality</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable the Burst functionality</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLEAVAIL</name>
              <description>AVAILABILITY of the BLE functionality</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AVAIL</name>
                  <description>BLE functionality available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTAVAIL</name>
                  <description>BLE functionality not available</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLEACK</name>
              <description>ACK for BLEREQ</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

