sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
            <field>
              <name>ADCREFBUFTRIM</name>
              <description>ADC Reference buffer trim</description>
              <bitRange>[10:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADCREFKEEPIBTRIM</name>
              <description>ADC Reference Ibias trim</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADCREFCOMP</name>
          <description>ADC Referece Keeper and Comparator Control</description>
          <addressOffset>0x0000011C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00011F01</resetMask>

          <fields>
            <field>
              <name>ADCRFCMPEN</name>
              <description>ADC Reference comparator power down</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADCREFKEEPTRIM</name>
              <description>ADC Reference Keeper Trim</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADC_REFCOMP_OUT</name>
              <description>Output of the ADC reference comparator</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>XTALCTRL</name>
          <description>XTAL Oscillator Control</description>
          <addressOffset>0x00000120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000358</resetValue>
          <resetMask>0x000003FF</resetMask>

          <fields>
            <field>
              <name>XTALICOMPTRIM</name>
              <description>XTAL ICOMP trim</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALIBUFTRIM</name>
              <description>XTAL IBUFF trim</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWDBODXTAL</name>
              <description>XTAL Power down on brown out.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWRUPBOD</name>
                  <description>Power up xtal on BOD</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWRDNBOD</name>
                  <description>Power down XTAL on BOD.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDNBCMPRXTAL</name>
              <description>XTAL Oscillator Power Down Comparator.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWRUPCOMP</name>
                  <description>Power up XTAL oscillator comparator.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWRDNCOMP</name>
                  <description>Power down XTAL oscillator comparator.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDNBCOREXTAL</name>
              <description>XTAL Oscillator Power Down Core.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWRUPCORE</name>
                  <description>Power up XTAL oscillator core.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWRDNCORE</name>
                  <description>Power down XTAL oscillator core.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BYPCMPRXTAL</name>
              <description>XTAL Oscillator Bypass Comparator.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USECOMP</name>
                  <description>Use the XTAL oscillator comparator.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYPCOMP</name>
                  <description>Bypass the XTAL oscillator comparator.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FDBKDSBLXTAL</name>
              <description>XTAL Oscillator Disable Feedback.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable XTAL oscillator comparator.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable XTAL oscillator comparator.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTALSWE</name>
              <description>XTAL Software Override Enable.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OVERRIDE_DIS</name>
                  <description>XTAL Software Override Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVERRIDE_EN</name>
                  <description>XTAL Software Override Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>XTALGENCTRL</name>
          <description>XTAL Oscillator General Control</description>
          <addressOffset>0x00000124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000100</resetValue>
          <resetMask>0x00003FFF</resetMask>

          <fields>
            <field>
              <name>XTALKSBIASTRIM</name>
              <description>XTAL IBIAS Kick start trim. This trim value is used during the startup process to enable a faster lock.</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>

