sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
            <field>
              <name>XTALBIASTRIM</name>
              <description>XTAL BIAS trim</description>
              <bitRange>[7:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ACWARMUP</name>
              <description>Auto-calibration delay control</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEC1</name>
                  <description>Warmup period of 1-2 seconds</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEC2</name>
                  <description>Warmup period of 2-4 seconds</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEC4</name>
                  <description>Warmup period of 4-8 seconds</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEC8</name>
                  <description>Warmup period of 8-16 seconds</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MISCCTRL</name>
          <description>Miscellaneous control register.</description>
          <addressOffset>0x00000198</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>BLE_RESETN</name>
              <description>BLE reset signal.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESERVED_RW_0</name>
              <description>Reserved bits, always leave unchanged.  The MISCCTRL register must be modified via atomic RMW, leaving this bitfield completely unmodified.  Failure to do so will result in unpredictable behavior.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>BOOTLOADER</name>
          <description>Bootloader and secure boot functions</description>
          <addressOffset>0x000001A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000007</resetValue>
          <resetMask>0xFC000007</resetMask>

          <fields>
            <field>
              <name>SECBOOTONRST</name>
              <description>Indicates whether the secure boot on warm reset is enabled</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Secure boot disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Secure boot enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERROR</name>
                  <description>Error in secure boot configuration</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SECBOOT</name>
              <description>Indicates whether the secure boot on cold reset is enabled</description>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Secure boot disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Secure boot enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERROR</name>
                  <description>Error in secure boot configuration</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SECBOOTFEATURE</name>
              <description>Indicates whether the secure boot feature is enabled.</description>
              <bitRange>[27:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Secure boot disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Secure boot enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERROR</name>
                  <description>Error in secure boot configuration</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PROTLOCK</name>
              <description>Flash protection lock.  Always resets to 1, write 1 to clear.  Enables writes to flash protection register set.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK</name>
                  <description>Enable the secure boot lock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SBLOCK</name>
              <description>Secure boot lock.  Always resets to 1, write 1 to clear.  Enables system visibility to bootloader until set.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK</name>
                  <description>Enable the secure boot lock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOTLOADERLOW</name>
              <description>Determines whether the bootloader code is visible at address 0x00000000 or not.  Resets to 1, write 1 to clear.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDR0</name>
                  <description>Bootloader code at 0x00000000.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SHADOWVALID</name>
          <description>Register to indicate whether the shadow registers have been successfully loaded from the Flash Information Space.</description>
          <addressOffset>0x000001A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000007</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>INFO0_VALID</name>
              <description>Indicates whether info0 contains valid data</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Flash info0 (customer) space contains valid data.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLDSLEEP</name>
              <description>Indicates whether the bootloader should sleep or deep sleep if no image loaded.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEEPSLEEP</name>
                  <description>Bootloader will go to deep sleep if no flash image loaded</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VALID</name>
              <description>Indicates whether the shadow registers contain valid data from the Flash Information Space.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Flash information space contains valid data.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SCRATCH0</name>
          <description>Scratch register that is not reset by any reset</description>
          <addressOffset>0x000001B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>SCRATCH0</name>
              <description>Scratch register 0.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

