sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
            <field>
              <name>DMAOPT</name>
              <description>Enables DMA latency optimizations</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>DMA will fully serialize DMA operations (Apollo3 A/B behavior)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>DMA will optimize DMA operations to minimize DMA latenchy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DECODEABORT</name>
              <description>APB Decode Abort. When set, the APB bridge will issue a data abort (bus fault) on transactions to peripherals that are powered down. When set to 0, writes are quietly discarded and reads return 0.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Bus operations to powered down peripherals are quietly discarded</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Bus operations to powered down peripherals result in a bus fault.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_ENABLE</name>
              <description>Enable the DMA controller.  When disabled, DMA requests will be ignored by the controller</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>DMA operations disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>DMA operations enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAMMODE</name>
          <description>SRAM Controller mode bits</description>
          <addressOffset>0x00000284</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000033</resetMask>

          <fields>
            <field>
              <name>DPREFETCH_CACHE</name>
              <description>Secondary prefetch feature that will cache prefetched data across bus waitstates (requires DPREFETCH to be set).</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DPREFETCH</name>
              <description>When set, data bus accesses to the SRAM banks will be prefetched (normally 2 cycle read access).  Use of this mode bit is only recommended if the work flow has a large number of sequential accesses.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IPREFETCH_CACHE</name>
              <description>Secondary prefetch feature that will cache prefetched data across bus waitstates (requires IPREFETCH to be set).</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IPREFETCH</name>
              <description>When set, instruction accesses to the SRAM banks will be prefetched (normally 2 cycle read access).  Generally, this mode bit should be set for improved performance when executing instructions from SRAM.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>KEXTCLKSEL</name>
          <description>Key Register to enable the use of external clock selects via the EXTCLKSEL reg</description>
          <addressOffset>0x00000348</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>KEXTCLKSEL</name>
              <description>Key register value.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Key</name>
                  <description>Key</description>
                  <value>83</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SIMOBUCK4</name>
          <description>SIMO Buck Control Reg1</description>
          <addressOffset>0x0000035C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3C8D80AA</resetValue>
          <resetMask>0x00600000</resetMask>

          <fields>
            <field>
              <name>SIMOBUCKCLKDIVSEL</name>
              <description>simobuck_clkdiv_sel</description>
              <bitRange>[22:21]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>BLEBUCK2</name>
          <description>BLEBUCK2 Control Reg</description>
          <addressOffset>0x00000368</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000004E</resetValue>
          <resetMask>0x0003FFFF</resetMask>

          <fields>
            <field>
              <name>BLEBUCKTOND2ATRIM</name>
              <description>blebuck_ton_trim</description>
              <bitRange>[17:12]</bitRange>
              <access>read-write</access>

