sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
          </fields>
        </register>
        <register>
          <name>FLASHRPROT3</name>
          <description>Flash Read Protection Bits</description>
          <addressOffset>0x000003BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FR3BITS</name>
              <description>Copy (read) protect flash 0x00180000 - 0x001FFFFF. Each bit provides read protection for 16KB chunks of flash.  Bits are cleared by writing a 1 to the bit.  When read, 0 indicates the region is protected. Bits are sticky (can be set when PROTLOCK is 1, but only cleared by reset)</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMASRAMWRITEPROTECT0</name>
          <description>SRAM write-protection bits.</description>
          <addressOffset>0x000003C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DMA_WPROT0</name>
              <description>Write protect SRAM from DMA.  Each bit provides write protection for an 8KB region of memory.  When set to 1, the region will be protected from DMA writes, when set to 0, DMA may write the region.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMASRAMWRITEPROTECT1</name>
          <description>SRAM write-protection bits.</description>
          <addressOffset>0x000003C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DMA_WPROT1</name>
              <description>Write protect SRAM from DMA.  Each bit provides write protection for an 8KB region of memory.  When set to 1, the region will be protected from DMA writes, when set to 0, DMA may write the region.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMASRAMREADPROTECT0</name>
          <description>SRAM read-protection bits.</description>
          <addressOffset>0x000003D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DMA_RPROT0</name>
              <description>Read protect SRAM from DMA.  Each bit provides write protection for an 8KB region of memory.  When set to 1, the region will be protected from DMA reads, when set to 0, DMA may read the region.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMASRAMREADPROTECT1</name>
          <description>SRAM read-protection bits.</description>
          <addressOffset>0x000003D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DMA_RPROT1</name>
              <description>Read protect SRAM from DMA.  Each bit provides write protection for an 8KB region of memory.  When set to 1, the region will be protected from DMA reads, when set to 0, DMA may read the region.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMASRAMREADPROTECT2</name>
          <description>SRAM read-protection bits.</description>
          <addressOffset>0x000003D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DMA_RPROT2</name>
              <description>Read protect SRAM from DMA.  Each bit provides write protection for an 8KB region of memory.  When set to 1, the region will be protected from DMA reads, when set to 0, DMA may read the region.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>MSPI0</name>
      <version>1.0</version>
      <description>Multibit SPI Master</description>
      <!-- <groupName>GROUP_MSPI</groupName> -->
      <baseAddress>0x50014000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x000002C8</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>MSPI0</name>
        <value>20</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>MSPI PIO Transfer Control/Status Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF1FFF</resetMask>

          <fields>
            <field>
              <name>XFERBYTES</name>
              <description>Number of bytes to transmit or receive (based on TXRX bit)</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

