sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
            <field>
              <name>ENDCX</name>
              <description>Enable DCX signal on data [1]</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PIOSCRAMBLE</name>
              <description>Enables data scrambling for PIO opertions.  This should only be used for data operations and never for commands to a device.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXRX</name>
              <description>1 Indicates a TX operation, 0 indicates an RX operation of XFERBYTES</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SENDI</name>
              <description>Indicates whether an instruction phase should be sent (see INSTR field and ISIZE field in CFG register)</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SENDA</name>
              <description>Indicates whether an address phase should be sent (see ADDR register and ASIZE field in CFG register)</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ENTURN</name>
              <description>Indicates whether TX->RX turnaround cycles should be enabled for this operation (see TURNAROUND field in CFG register).</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BIGENDIAN</name>
              <description>1 indicates data in FIFO is in big endian format (MSB first); 0 indicates little endian data (default, LSB first).</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CONT</name>
              <description>Continuation transfer.  When 1, indicates that the MSPI will hold CE low after the transaction completes.  This is included for compatibility with IOM module since the MSPI transfer module can handle most cases in a single transfer.  NOTE:  CONT functionality only works with CLKDIV=2 (24 MHz).</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ENWLAT</name>
              <description>Enable Write Latency Counter (time between address and first data byte).  Counter value is WRITELATENCY.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>QUADCMD</name>
              <description>Flag indicating that the operation is a command that should be replicated to both devices in paired QUAD mode.  This is typically only used when reading/writing configuration registers in paired flash devices (do not set for memory transfers).</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BUSY</name>
              <description>Command status:  1 indicates controller is busy (command in progress)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STATUS</name>
              <description>Command status:  1 indicates command has completed.  Cleared by writing 1 to this bit or starting a new transfer.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>START</name>
              <description>Write to 1 to initiate a PIO transaction on the bus (typically the entire register should be written at once with this bit set).</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <description>MSPI Transfer Configuration Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x03F33FFF</resetMask>

          <fields>
            <field>
              <name>WRITELATENCY</name>
              <description>Number of cycles between addressn and TX data.  Qualified by ENLAT</description>
              <bitRange>[25:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CPOL</name>
              <description>Serial clock polarity.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Clock inactive state is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Clock inactive state is high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPHA</name>
              <description>Serial clock phase.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIDDLE</name>
                  <description>Clock toggles in middle of data bit.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START</name>
                  <description>Clock toggles at start of data bit.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TURNAROUND</name>
              <description>Number of turnaound cycles (for TX->RX transitions).  Qualified by ENTURN or XIPENTURN bit field.</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>

