sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
            <field>
              <name>RXDQSDELAY</name>
              <description>When OVERRIDEDQSDELAY is set this sets the DQS delayline value.  In ENABLEDQS mode, this acts as an offset to the computed value (should be set to 0 by default)</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ENABLEFINEDELAY</name>
              <description>Enables use of delay line to provide fine control over traditional RX capture clock.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OVERRIDEDDRCLKOUTDELAY</name>
              <description>Override TX delay line with the value in DQSDELAY (for TX clock offset when in QUADDDR mode)</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OVERRIDERXDQSDELAY</name>
              <description>Override DQS delay line with the value in DQSDELAY (for RX capture in QUADDDR mode)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DQSSYNCNEG</name>
              <description>Use negative edge of clock for DDR data sync</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ENABLEDQS</name>
              <description>In EMULATEDDR mode, enable DQS for read capture</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>QUADDDR</name>
              <description>Enables use of delay line to provide fine control over traditional RX capture clock.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>EMULATEDDR</name>
              <description>Drive external clock at 1/2 rate to emulate DDR mode</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PADCFG</name>
          <description>MSPI Output Pad Configuration</description>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x003F001F</resetMask>

          <fields>
            <field>
              <name>REVCS</name>
              <description>Reverse CS connections.  Allows CS1 to be associated with lower data lanes and CS0 to be associated with upper data lines</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IN3</name>
              <description>Data Input pad 3 pin muxing: 0=pad[3] 1=pad[7]</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IN2</name>
              <description>Data Input pad 2 pin muxing: 0=pad[2] 1=pad[6]</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IN1</name>
              <description>Data Input pad 1 pin muxing: 0=pad[1] 1=pad[5]</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IN0</name>
              <description>Data Input pad 0 pin muxing:  0=pad[0] 1=pad[4] 2=pad[1] 3=pad[5]</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OUT7</name>
              <description>Output pad 7 configuration.  0=data[7] 1=data[3]</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OUT6</name>
              <description>Output pad 6 configuration.  0=data[6] 1=data[2]</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OUT5</name>
              <description>Output pad 5 configuration.  0=data[5] 1=data[1]</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OUT4</name>
              <description>Output pad 4 configuration.  0=data[4] 1=data[0]</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OUT3</name>
              <description>Output pad 3 configuration.  0=data[3] 1=CLK</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PADOUTEN</name>
          <description>MSPI Output Enable Pad Configuration</description>
          <addressOffset>0x00000114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>

          <fields>
            <field>
              <name>OUTEN</name>
              <description>Output pad enable configuration.  Indicates which pads should be driven.  Bits [3:0] are Quad0 data, [7:4] are Quad1 data, and [8] is clock.</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QUAD0</name>
                  <description>Quad0 (4 data + 1 clock)</description>
                  <value>271</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD1</name>
                  <description>Quad1 (4 data + 1 clock)</description>
                  <value>496</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCTAL</name>
                  <description>Octal (8 data + 1 clock)</description>
                  <value>1023</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SERIAL0</name>
                  <description>Serial (2 data + 1 clock)</description>
                  <value>259</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PADOVEREN</name>
          <description>MSPI Output Pad Override</description>
          <addressOffset>0x00000118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>

          <fields>
            <field>
              <name>OVERRIDEEN</name>
              <description>Output pad override enable.  Bit mask for pad outputs.  When set to 1, the values in the OVERRIDE field are driven on the pad (output enable is implicitly set in this mode).  [7:0]=data [8]=clock [9]=DM</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>

