sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
          </fields>
        </register>
        <register>
          <name>PADOVER</name>
          <description>MSPI Output Pad Override Value</description>
          <addressOffset>0x0000011C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>

          <fields>
            <field>
              <name>OVERRIDE</name>
              <description>Output pad override value.  [7:0]=data [8]=clock [9]=DM</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FLASH</name>
          <description>Configuration for XIP/DMA support of SPI flash modules.</description>
          <addressOffset>0x00000120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>

          <fields>
            <field>
              <name>XIPENWLAT</name>
              <description>Enable Write Latency counter for XIP write transactions</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XIPMIXED</name>
              <description>Reserved.  Set to 0x0</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Transfers all proceed using the settings in DEVCFG register (everything in the same data rate)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D2</name>
                  <description>Data operations proceed in dual data rate</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AD2</name>
                  <description>Address and Data operations proceed in dual data rate</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D4</name>
                  <description>Data operations proceed in quad data rate</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AD4</name>
                  <description>Address and Data operations proceed in quad data rate</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XIPSENDI</name>
              <description>Indicates whether XIP/AUTO DMA operations should send an instruction (see READINSTR field and ISIZE field in CFG)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XIPSENDA</name>
              <description>Indicates whether XIP/AUTO DMA operations should send an an address phase (see DMADEVADDR register and ASIZE field in CFG)</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XIPENTURN</name>
              <description>Indicates whether XIP/AUTO DMA operations should enable TX->RX turnaround cycles</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XIPBIGENDIAN</name>
              <description>Indicates whether XIP/AUTO DMA data transfers are in big or little endian format</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XIPACK</name>
              <description>Controls transmission of Micron XIP acknowledge cycles (Micron Flash devices only)</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOACK</name>
                  <description>No acknowledege sent.  Data IOs are tristated the first turnaround cycle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACK</name>
                  <description>Positive acknowledege sent.  Data IOs are driven to 0 the first turnaround cycle to acknowledge XIP mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TERMINATE</name>
                  <description>Negative acknowledege sent.  Data IOs are driven to 1 the first turnaround cycle to terminate XIP mode.  XIPSENDI should be reenabled for the next transfer</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XIPENDCX</name>
              <description>Enable DCX signal on data [1] for XIP/DMA operations</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XIPEN</name>
              <description>Enable the XIP (eXecute In Place) function which effectively enables the address decoding of the MSPI device in the flash/cache address space at address 0x04000000-0x07FFFFFF.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>XIPINSTR</name>
          <description>Configuration for XIP/DMA support of SPI flash modules.</description>
          <addressOffset>0x00000124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000B0006</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>READINSTR</name>
              <description>Read command sent to flash for DMA/XIP operations</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

