sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
            <field>
              <name>WRITEINSTR</name>
              <description>Write command sent for DMA operations</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SCRAMBLING</name>
          <description>External Flash Scrambling Controls</description>
          <addressOffset>0x00000128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x83FF03FF</resetMask>

          <fields>
            <field>
              <name>SCRENABLE</name>
              <description>Enables Data Scrambling Region.  When 1 reads and writes to the range will be scrambled.  When 0, data will be read/written unmodified.  Address range is specified in 64K granularity and the START/END ranges are included within the range.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SCREND</name>
              <description>Scrambling region end address [25:16] (64K block granularity).  The END block is the LAST block included in the scrambled address range.</description>
              <bitRange>[25:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SCRSTART</name>
              <description>Scrambling region start address [25:16] (64K block granularity).  The START block is the FIRST block included in the scrambled address range.</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>MSPI Master Interrupts: Enable</description>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001FFF</resetMask>

          <fields>
            <field>
              <name>SCRERR</name>
              <description>Scrambling Alignment Error.  Scrambling operations must be aligned to word (4-byte) start address.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CQERR</name>
              <description>Command Queue Error Interrupt</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CQPAUSED</name>
              <description>Command Queue is Paused.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CQUPD</name>
              <description>Command Queue Update Interrupt.  Issued whenever the CQ performs an operation where address bit[0] is set.  Useful for triggering CURIDX interrupts.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CQCMP</name>
              <description>Command Queue Complete Interrupt</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DERR</name>
              <description>DMA Error Interrupt</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DCMP</name>
              <description>DMA Complete Interrupt</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXF</name>
              <description>Receive FIFO full</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXO</name>
              <description>Receive FIFO overflow (cannot happen in MSPI design -- MSPI bus pins will stall)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXU</name>
              <description>Receive FIFO underflow (only occurs when SW reads from an empty FIFO)</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXO</name>
              <description>Transmit FIFO Overflow (only occurs when SW writes to a full FIFO).</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXE</name>
              <description>Transmit FIFO empty.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CMDCMP</name>
              <description>Transfer complete.  Note that DMA and CQ operations are layered, so CMDCMP, DCMP, and CQ* can all be signalled simultaneously</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTSTAT</name>
          <description>MSPI Master Interrupts: Status</description>
          <addressOffset>0x00000204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001FFF</resetMask>

          <fields>
            <field>
              <name>SCRERR</name>
              <description>Scrambling Alignment Error.  Scrambling operations must be aligned to word (4-byte) start address.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

