sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
            <field>
              <name>DMAERR</name>
              <description>DMA Error. This active high bit signals that an error was encountered during the DMA operation.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DMACPL</name>
              <description>DMA Transfer Complete. This signals the end of the DMA operation.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DMATIP</name>
              <description>DMA Transfer In Progress indicator.  1 will indicate that a DMA transfer is active.  The DMA transfer may be waiting on data, transferring data, or waiting for priority.  All of these will be indicated with a 1.  A 0 will indicate that the DMA is fully complete and no further transactions will be done.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMATARGADDR</name>
          <description>DMA Target Address Register</description>
          <addressOffset>0x00000258</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>TARGADDR</name>
              <description>Target byte address for source of DMA (either read or write). In cases of non-word aligned addresses, the DMA logic will take care for ensuring only the target bytes are read/written.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMADEVADDR</name>
          <description>DMA Device Address Register</description>
          <addressOffset>0x0000025C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DEVADDR</name>
              <description>SPI Device address for automated DMA transactions (both read and write).</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMATOTCOUNT</name>
          <description>DMA Total Transfer Count</description>
          <addressOffset>0x00000260</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>

          <fields>
            <field>
              <name>TOTCOUNT</name>
              <description>Total Transfer Count in bytes.</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMABCOUNT</name>
          <description>DMA BYTE Transfer Count</description>
          <addressOffset>0x00000264</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000020</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>BCOUNT</name>
              <description>Burst transfer size in bytes. This is the number of bytes transferred when a FIFO trigger event occurs.  Recommended value is 32.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMATHRESH</name>
          <description>DMA Transmit Trigger Threshhold</description>
          <addressOffset>0x00000268</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000808</resetValue>
          <resetMask>0x00001F1F</resetMask>

          <fields>
            <field>
              <name>DMARXTHRESH</name>
              <description>DMA transfer FIFO level trigger.  For read operations, DMA is triggered when the FIFO level is greater than this value.  For write operations, DMA is triggered when the FIFO level is less than this level.  Each DMA operation will consist of BCOUNT bytes.</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DMATXTHRESH</name>
              <description>DMA transfer FIFO level trigger.  For read operations, DMA is triggered when the FIFO level is greater than this value.  For write operations, DMA is triggered when the FIFO level is less than this level.  Each DMA operation will consist of BCOUNT bytes.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMABOUNDARY</name>
          <description>DMA Transfer Boundary</description>
          <addressOffset>0x0000026C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>DMABOUND</name>
              <description>DMA Address boundray</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Disable DMA address boundary breaks</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK32</name>
                  <description>Break at 32 byte boundary (0x20 increments)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK64</name>
                  <description>Break at 64 byte boundary (0x40 increments)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK128</name>
                  <description>Break at 128 byte boundary (0x80 increments)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK256</name>
                  <description>Break at 256 byte boundary (0x100 increments)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK512</name>
                  <description>Break at 512 byte boundary (0x200 increments)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK1K</name>
                  <description>Break at 1KB boundary (0x400 increments)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK2K</name>
                  <description>Break at 2KB boundary (0x800 increments)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK4K</name>
                  <description>Break at 4KB boundary (0x1000 increments)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK8K</name>
                  <description>Break at 8KB boundary (0x2000 increments)</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK16K</name>
                  <description>Break at 16KB boundary (0x4000 increments)</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMATIMELIMIT</name>
              <description>DMA time limit.  Can be used to limit the tranaction time on the MSPI bus.  The count is in 100ns incremements.  A value of 0 disables the counter</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>

