sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
            <field>
              <name>CQFTOGGLE</name>
              <description>Toggle CQFlag status bits</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CQFSET</name>
              <description>Set CQFlag status bits.  Set has priority over clear if both are high.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CQPAUSE</name>
          <description>Command Queue Pause Mask Register</description>
          <addressOffset>0x000002B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>CQMASK</name>
              <description>CQ will pause processing when ALL specified events are satisfied -- i.e. when (CQMASK and CQPAUSE)==CQMASK.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>CQ Stop Flag.  When set, CQ processing will complete.</description>
                  <value>32768</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CQIDX</name>
                  <description>CQ Index Pointers (CURIDX/ENDIDX) match.</description>
                  <value>16384</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUF1XOREN</name>
                  <description>Buffer 1 Ready Status (from selected IOM/MSPI).  This status is the result of XOR'ing the IOM1START with the incoming status from the IOM.  When high, MSPI can transfer the buffer.</description>
                  <value>8192</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUF0XOREN</name>
                  <description>Buffer 0 Ready Status (from selected IOM/MSPI).  This status is the result of XOR'ing the IOM0START with the incoming status from the IOM.  When high, MSPI can transfer the buffer.</description>
                  <value>4096</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMACPL</name>
                  <description>DMA Complete Status (hardwired DMACPL bit in DMASTAT)</description>
                  <value>2048</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDCPL</name>
                  <description>PIO Operation completed (STATUS bit in CTRL register)</description>
                  <value>1024</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM1READY</name>
                  <description>IOM Buffer 1 Ready Status (from selected IOM).  This status is the result of XNOR'ing the IOM0START with the incoming status from the IOM.  When high, MSPI can send to the buffer.</description>
                  <value>512</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM0READY</name>
                  <description>IOM Buffer 0 Ready Status (from selected IOM).  This status is the result of XNOR'ing the IOM0START with the incoming status from the IOM.  When high, MSPI can send to the buffer.</description>
                  <value>256</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWFLAG7</name>
                  <description>Software flag 7.  Can be used by software to start/pause operations</description>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWFLAG6</name>
                  <description>Software flag 6. Can be used by software to start/pause operatoins</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWFLAG5</name>
                  <description>Software flag 5.  Can be used by software to start/pause operations</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWFLAG4</name>
                  <description>Software flag 4. Can be used by software to start/pause operatoins</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWFLAG3</name>
                  <description>Software flag 3.  Can be used by software to start/pause operations</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWFLAG2</name>
                  <description>Software flag 2. Can be used by software to start/pause operatoins</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWFLAG1</name>
                  <description>Software flag 1.  Can be used by software to start/pause operations</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWFLAG0</name>
                  <description>Software flag 0. Can be used by software to start/pause operatoins</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CQCURIDX</name>
          <description>Command Queue Current Index</description>
          <addressOffset>0x000002C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>CQCURIDX</name>
              <description>Can be used to indicate the current position of the command  queue by having CQ operations write this field.  A CQ hardware status flag indicates when CURIDX and ENDIDX are not equal, allowing SW to pause the CQ processing until the end index is updated.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

