sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
          </fields>
        </register>
        <register>
          <name>CQENDIDX</name>
          <description>Command Queue End Index</description>
          <addressOffset>0x000002C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>CQENDIDX</name>
              <description>Can be used to indicate the end position of the command queue.  A CQ hardware status bit indices when CURIDX != ENDIDX so that the CQ can be paused when it reaches the end pointer.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="MSPI0">
      <name>MSPI1</name>
      <baseAddress>0x50015000</baseAddress>
      <interrupt>
        <name>MSPI1</name>
        <value>32</value>
      </interrupt>
    </peripheral>    <peripheral derivedFrom="MSPI0">
      <name>MSPI2</name>
      <baseAddress>0x50016000</baseAddress>
      <interrupt>
        <name>MSPI2</name>
        <value>33</value>
      </interrupt>
    </peripheral>

    <peripheral>
      <name>PDM</name>
      <version>1.0</version>
      <description>PDM Audio</description>
      <!-- <groupName>GROUP_PDM</groupName> -->
      <baseAddress>0x50011000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000294</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PDM</name>
        <value>19</value>
      </interrupt>
      <registers>
        <register>
          <name>PCFG</name>
          <description>PDM Configuration Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000C365</resetValue>
          <resetMask>0xFFE7FFFF</resetMask>

          <fields>
            <field>
              <name>LRSWAP</name>
              <description>Left/right channel swap.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Swap left and right channels (FIFO Read RIGHT_LEFT).</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOSWAP</name>
                  <description>No channel swapping (IFO Read LEFT_RIGHT).</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGARIGHT</name>
              <description>Right channel PGA gain.</description>
              <bitRange>[30:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P405DB</name>
                  <description>40.5 db gain.</description>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P390DB</name>
                  <description>39.0 db gain.</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P375DB</name>
                  <description>37.5 db gain.</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P360DB</name>
                  <description>36.0 db gain.</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P345DB</name>
                  <description>34.5 db gain.</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P330DB</name>
                  <description>33.0 db gain.</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P315DB</name>
                  <description>31.5 db gain.</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P300DB</name>
                  <description>30.0 db gain.</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P285DB</name>
                  <description>28.5 db gain.</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P270DB</name>
                  <description>27.0 db gain.</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P255DB</name>
                  <description>25.5 db gain.</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P240DB</name>
                  <description>24.0 db gain.</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P225DB</name>
                  <description>22.5 db gain.</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P210DB</name>
                  <description>21.0 db gain.</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P195DB</name>
                  <description>19.5 db gain.</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P180DB</name>
                  <description>18.0 db gain.</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P165DB</name>
                  <description>16.5 db gain.</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P150DB</name>
                  <description>15.0 db gain.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P135DB</name>
                  <description>13.5 db gain.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P120DB</name>
                  <description>12.0 db gain.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P105DB</name>
                  <description>10.5 db gain.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P90DB</name>
                  <description>9.0 db gain.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P75DB</name>
                  <description>7.5 db gain.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P60DB</name>
                  <description>6.0 db gain.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P45DB</name>
                  <description>4.5 db gain.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P30DB</name>
                  <description>3.0 db gain.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P15DB</name>
                  <description>1.5 db gain.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0DB</name>
                  <description>0.0 db gain.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M15DB</name>
                  <description>-1.5 db gain.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M300DB</name>
                  <description>-3.0 db gain.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M45DB</name>
                  <description>-4.5 db gain.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M60DB</name>
                  <description>-6.0 db gain.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGALEFT</name>
              <description>Left channel PGA gain.</description>
              <bitRange>[25:21]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P405DB</name>
                  <description>40.5 db gain.</description>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P390DB</name>
                  <description>39.0 db gain.</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P375DB</name>
                  <description>37.5 db gain.</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P360DB</name>
                  <description>36.0 db gain.</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P345DB</name>
                  <description>34.5 db gain.</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P330DB</name>
                  <description>33.0 db gain.</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P315DB</name>
                  <description>31.5 db gain.</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P300DB</name>
                  <description>30.0 db gain.</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P285DB</name>
                  <description>28.5 db gain.</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P270DB</name>
                  <description>27.0 db gain.</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P255DB</name>
                  <description>25.5 db gain.</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P240DB</name>
                  <description>24.0 db gain.</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P225DB</name>
                  <description>22.5 db gain.</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P210DB</name>
                  <description>21.0 db gain.</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P195DB</name>
                  <description>19.5 db gain.</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P180DB</name>
                  <description>18.0 db gain.</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P165DB</name>
                  <description>16.5 db gain.</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P150DB</name>
                  <description>15.0 db gain.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P135DB</name>
                  <description>13.5 db gain.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P120DB</name>
                  <description>12.0 db gain.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P105DB</name>
                  <description>10.5 db gain.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P90DB</name>
                  <description>9.0 db gain.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P75DB</name>
                  <description>7.5 db gain.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P60DB</name>
                  <description>6.0 db gain.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P45DB</name>
                  <description>4.5 db gain.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P30DB</name>
                  <description>3.0 db gain.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P15DB</name>
                  <description>1.5 db gain.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0DB</name>
                  <description>0.0 db gain.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M15DB</name>
                  <description>-1.5 db gain.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M300DB</name>
                  <description>-3.0 db gain.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M45DB</name>
                  <description>-4.5 db gain.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M60DB</name>
                  <description>-6.0 db gain.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCLKDIV</name>
              <description>PDM_CLK frequency divisor.</description>
              <bitRange>[18:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MCKDIV4</name>
                  <description>Divide input clock by 4</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV3</name>
                  <description>Divide input clock by 3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV2</name>
                  <description>Divide input clock by 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKDIV1</name>
                  <description>Divide input clock by 1</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SINCRATE</name>
              <description>SINC decimation rate.</description>
              <bitRange>[16:10]</bitRange>
              <access>read-write</access>

