sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
          </fields>
        </register>
        <register>
          <name>DMATARGADDR</name>
          <description>DMA Target Address Register</description>
          <addressOffset>0x0000028C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>UTARGADDR</name>
              <description>SRAM Target</description>
              <bitRange>[31:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LTARGADDR</name>
              <description>DMA Target Address. This register is not updated with the current address of the DMA, but will remain static with the original address during the DMA transfer.</description>
              <bitRange>[20:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMASTAT</name>
          <description>DMA Status Register</description>
          <addressOffset>0x00000290</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>DMAERR</name>
              <description>DMA Error</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DMACPL</name>
              <description>DMA Transfer Complete</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DMATIP</name>
              <description>DMA Transfer In Progress</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>PWRCTRL</name>
      <version>1.0</version>
      <description>PWR Controller Register Bank</description>
      <!-- <groupName>GROUP_PWRCTRL</groupName> -->
      <baseAddress>0x40021000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000030</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <register>
          <name>SUPPLYSRC</name>
          <description>Voltage Regulator Select Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>BLEBUCKEN</name>
              <description>Enables and Selects the BLE Buck as the supply for the BLE power domain or for Burst LDO. It takes the initial value from Customer INFO space. Buck will be powered up only if there is an active request for BLEH domain or Burst mode and appropriate feature is allowed.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable the BLE Buck.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable the BLE Buck.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUPPLYSTATUS</name>
          <description>Voltage Regulators status</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>BLEBUCKON</name>
              <description>Indicates whether the BLE (if supported) domain and burst (if supported) domain is supplied from the LDO or the Buck. Buck will be powered up only if there is an active request for BLEH domain or Burst mode and appropriate reature is allowed.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO</name>
                  <description>Indicates the the LDO is supplying the BLE/Burst power domain</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUCK</name>
                  <description>Indicates the the Buck is supplying the BLE/Burst power domain</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIMOBUCKON</name>
              <description>Indicates whether the Core/Mem low-voltage domains are supplied from the LDO or the Buck.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Indicates the the SIMO Buck is OFF.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Indicates the the SIMO Buck is ON.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVPWREN</name>
          <description>Device Power Enables</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>PWRBLEL</name>
              <description>Power up BLE controller</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up BLE controller</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down BLE controller</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRPDM</name>
              <description>Power up PDM block</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up PDM</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down PDM</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRMSPI2</name>
              <description>Power up MSPI2 Controller</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up MSPI2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down MSPI2</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRMSPI1</name>
              <description>Power up MSPI1 Controller</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up MSPI1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down MSPI1</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRMSPI0</name>
              <description>Power up MSPI0 Controller</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up MSPI0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down MSPI0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSCARD</name>
              <description>Power up SCARD Controller</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up SCARD</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down SCARD</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRADC</name>
              <description>Power up ADC Digital Controller</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up ADC</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power Down ADC</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRUART1</name>
              <description>Power up UART Controller 1</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up UART 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down UART 1</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRUART0</name>
              <description>Power up UART Controller 0</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up UART 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down UART 0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRIOM5</name>
              <description>Power up IO Master 5</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up IO Master 5</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down IO Master 5</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRIOM4</name>
              <description>Power up IO Master 4</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up IO Master 4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down IO Master 4</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRIOM3</name>
              <description>Power up IO Master 3</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up IO Master 3</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down IO Master 3</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRIOM2</name>
              <description>Power up IO Master 2</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up IO Master 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down IO Master 2</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRIOM1</name>
              <description>Power up IO Master 1</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up IO Master 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down IO Master 1</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRIOM0</name>
              <description>Power up IO Master 0</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up IO Master 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down IO Master 0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRIOS</name>
              <description>Power up IO Slave</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up IO slave</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down IO slave</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MEMPWDINSLEEP</name>
          <description>Powerdown SRAM banks in Deep Sleep mode</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00006000</resetValue>
          <resetMask>0x80007FFF</resetMask>

