sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
            <field>
              <name>HCPA</name>
              <description>This bit is 1 if power is supplied to HCPA domain (IO SLAVE, UART0, UART1, SCARD)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUH</name>
              <description>This bit is 1 if power is supplied to MCUH</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUL</name>
              <description>This bit is 1 if power is supplied to MCUL</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SRAMCTRL</name>
          <description>SRAM Control register</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFF06</resetMask>

          <fields>
            <field>
              <name>SRAMLIGHTSLEEP</name>
              <description>Light Sleep enable for each TCM/SRAM bank.  When 1, corresponding bank will be put into light sleep.  For optimal power, banks should be put into light sleep while the system is active but the bank has minimal or no accesses.</description>
              <bitRange>[19:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALL</name>
                  <description>Enable LIGHT SLEEP for ALL SRAMs</description>
                  <value>255</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disables LIGHT SLEEP for ALL SRAMs</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAMMASTERCLKGATE</name>
              <description>This bit is 1 when the master clock gate is enabled (top-level clock gate for entire SRAM block)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable Master SRAM Clock Gate</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disables Master SRAM Clock Gating</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAMCLKGATE</name>
              <description>This bit is 1 if clock gating is allowed for individual system SRAMs</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable Individual SRAM Clock Gating</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disables Individual SRAM Clock Gating</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCSTATUS</name>
          <description>Power Status Register for ADC Block</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>REFBUFPWD</name>
              <description>This bit indicates that the ADC REFBUF is powered down</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>REFKEEPPWD</name>
              <description>This bit indicates that the ADC REFKEEP is powered down</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VBATPWD</name>
              <description>This bit indicates that the ADC VBAT resistor divider is powered down</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VPTATPWD</name>
              <description>This bit indicates that the ADC temperature sensor input buffer is powered down</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BGTPWD</name>
              <description>This bit indicates that the ADC Band Gap is powered down</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADCPWD</name>
              <description>This bit indicates that the ADC is powered down</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MISC</name>
          <description>Power Optimization Control Bits</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000048</resetMask>

          <fields>
            <field>
              <name>MEMVRLPBLE</name>
              <description>Control Bit to let Mem VR go to lp mode in deep sleep even when BLEL or BLEH is powered on given none of the other domains require it.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Mem VR can go to lp mode even when BLE is powered on.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Mem VR will stay in active mode when BLE is powered on.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCEMEMVRLPTIMERS</name>
              <description>Control Bit to force Mem VR to LP mode in deep sleep even when hfrc based ctimer or stimer is running.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

