sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
          </fields>
        </register>
        <register>
          <name>DEVPWREVENTEN</name>
          <description>Event enable register to control which DEVPWRSTATUS bits are routed to event input of CPU.</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xE00001FF</resetMask>

          <fields>
            <field>
              <name>BURSTEVEN</name>
              <description>Control BURST status event</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable BURST status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable BURST status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BURSTFEATUREEVEN</name>
              <description>Control BURSTFEATURE status event</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable BURSTFEATURE status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable BURSTFEATURE status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLEFEATUREEVEN</name>
              <description>Control BLEFEATURE status event</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable BLEFEATURE status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable BLEFEATURE status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLELEVEN</name>
              <description>Control BLE power-on status event</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable BLE power-on status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable BLE power-on status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDMEVEN</name>
              <description>Control PDM power-on status event</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable PDM power-on status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable PDM power-on status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSPIEVEN</name>
              <description>Control MSPI power-on status event</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable MSPI power-on status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable MSPI power-on status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCEVEN</name>
              <description>Control ADC power-on status event</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable ADC power-on status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable ADC power-on status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HCPCEVEN</name>
              <description>Control HCPC power-on status event</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable HCPC power-on status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable HCPC power-on status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HCPBEVEN</name>
              <description>Control HCPB power-on status event</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable HCPB power-on status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable HCPB power-on status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HCPAEVEN</name>
              <description>Control HCPA power-on status event</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable HCPA power-on status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable HCPA power-on status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCUHEVEN</name>
              <description>Control MCUH power-on status event</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable MCHU power-on status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable MCUH power-on status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCULEVEN</name>
              <description>Control MCUL power-on status event</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable MCUL power-on status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable MCUL power-on status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MEMPWREVENTEN</name>
          <description>Event enable register to control which MEMPWRSTATUS bits are routed to event input of CPU.</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xC0007FFF</resetMask>

          <fields>
            <field>
              <name>CACHEB2EN</name>
              <description>Control CACHEB2 power-on status event</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable CACHE BANK 2 status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable CACHE BANK 2 status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CACHEB0EN</name>
              <description>Control CACHE BANK 0 power-on status event</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable CACHE BANK 0 status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable CACHE BANK 0 status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH1EN</name>
              <description>Control Flash power-on status event</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable FLASH status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disables FLASH status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH0EN</name>
              <description>Control Flash power-on status event</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable FLASH status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disables FLASH status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAMEN</name>
              <description>Control SRAM power-on status event</description>
              <bitRange>[12:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Disable SRAM power-on status event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0EN</name>
                  <description>Enable SRAM group0 (0KB-32KB) power on status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP1EN</name>
                  <description>Enable SRAM group1 (32KB-64KB) power on status event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP2EN</name>
                  <description>Enable SRAM group2 (64KB-96KB) power on status event</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP3EN</name>
                  <description>Enable SRAM group3 (96KB-128KB) power on status event</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP4EN</name>
                  <description>Enable SRAM group4 (128KB-160KB) power on status event</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP5EN</name>
                  <description>Enable SRAM group5 (160KB-192KB) power on status event</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP6EN</name>
                  <description>Enable SRAM group6 (192KB-224KB) power on status event</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP7EN</name>
                  <description>Enable SRAM group7 (224KB-256KB) power on status event</description>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP8EN</name>
                  <description>Enable SRAM group8 (256KB-288KB) power on status event</description>
                  <value>256</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP9EN</name>
                  <description>Enable SRAM group9 (288KB-320KB) power on status event</description>
                  <value>512</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTCMEN</name>
              <description>Enable DTCM power-on status event</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do not enable DTCM power-on status event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0DTCM0EN</name>
                  <description>Enable GROUP0_DTCM0 power on status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0DTCM1EN</name>
                  <description>Enable GROUP0_DTCM1 power on status event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0EN</name>
                  <description>Enable DTCMs in group0 power on status event</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP1EN</name>
                  <description>Enable DTCMs in group1 power on status event</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL</name>
                  <description>Enable all DTCM power on status event</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
