sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <description>Status Register (SBL)</description>
          <addressOffset>0x0FFFF000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xC00007FF</resetMask>

          <fields>
            <field>
              <name>SBOOT</name>
              <description>Set when booting securely (SBL).</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FBOOT</name>
              <description>Set if current boot was initiated by soft reset and resulted in Fast Boot (SBL).</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BOBSTAT</name>
              <description>A BLE/Burst Regulator Brownout Event occurred (SBL).</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BOFSTAT</name>
              <description>A Memory Regulator Brownout Event occurred (SBL).</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BOCSTAT</name>
              <description>A Core Regulator Brownout Event occurred (SBL).</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BOUSTAT</name>
              <description>An Unregulated Supply Brownout Event occurred (SBL).</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WDRSTAT</name>
              <description>Reset was initiated by a Watchdog Timer Reset (SBL).</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DBGRSTAT</name>
              <description>Reset was a initiated by Debugger Reset (SBL).</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>POIRSTAT</name>
              <description>Reset was a initiated by Software POI Reset (SBL).</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SWRSTAT</name>
              <description>Reset was a initiated by SW POR or AIRCR Reset (SBL).</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BORSTAT</name>
              <description>Reset was initiated by a Brown-Out Reset (SBL).</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PORSTAT</name>
              <description>Reset was initiated by a Power-On Reset (SBL).</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>EXRSTAT</name>
              <description>Reset was initiated by an External Reset (SBL).</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>RTC</name>
      <version>1.0</version>
      <description>Real Time Clock</description>
      <!-- <groupName>GROUP_RTC</groupName> -->
      <baseAddress>0x40004200</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000110</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RTC</name>
        <value>2</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRLOW</name>
          <description>RTC Counters Lower</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x01000000</resetValue>
          <resetMask>0x3F7F7FFF</resetMask>

          <fields>
            <field>
              <name>CTRHR</name>
              <description>Hours Counter</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTRMIN</name>
              <description>Minutes Counter</description>
              <bitRange>[22:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTRSEC</name>
              <description>Seconds Counter</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTR100</name>
              <description>100ths of a second Counter</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CTRUP</name>
          <description>RTC Counters Upper</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x9FFF1F3F</resetMask>

          <fields>
            <field>
              <name>CTERR</name>
              <description>Counter read error status. Error is triggered when software reads the lower word of the counters, and fails to read the upper counter within 1/100 second.  This is because when the lower counter is read, the upper counter is held off from incrementing until it is read so that the full time stamp can be read.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOERR</name>
                  <description>No read error occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDERR</name>
                  <description>Read error occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEB</name>
              <description>Century enable</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable the Century bit from changing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable the Century bit to change</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CB</name>
              <description>Century</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2000</name>
                  <description>Century is 2000s</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1900_2100</name>
                  <description>Century is 1900s/2100s</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTRWKDY</name>
              <description>Weekdays Counter</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>

