sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
          </fields>
        </register>
        <register>
          <name>INTSTAT</name>
          <description>RTC Interrupt Register: Status</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>ALM</name>
              <description>RTC Alarm interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTCLR</name>
          <description>RTC Interrupt Register: Clear</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>ALM</name>
              <description>RTC Alarm interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTSET</name>
          <description>RTC Interrupt Register: Set</description>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>ALM</name>
              <description>RTC Alarm interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>SCARD</name>
      <version>1.0</version>
      <description>Serial ISO7816</description>
      <!-- <groupName>GROUP_SCARD</groupName> -->
      <baseAddress>0x40080000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000104</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SCARD</name>
        <value>17</value>
      </interrupt>
      <registers>
        <register>
          <name>SR</name>
          <description>ISO7816 interrupt status</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000007F</resetMask>

          <fields>
            <field>
              <name>FHF</name>
              <description>FIFO Half Full.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HALFFULL</name>
                  <description>FIFO is half full.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FT2REND</name>
              <description>TX to RX finished.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CMPL</name>
                  <description>TX to RX completed.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTCMPL</name>
                  <description>TX to RX not completed.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PE</name>
              <description>Parity Error.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PEERR</name>
                  <description>Parity error.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PENONE</name>
                  <description>No parity error.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVR</name>
              <description>RX FIFO overflow.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXOVR</name>
                  <description>RX FIFO overflow.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXOVRNONE</name>
                  <description>RX FIFO no overflow.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FER</name>
              <description>Framing error.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRAMINGERR</name>
                  <description>Framing error.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOFRAMINGERR</name>
                  <description>No framing error detected.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBERBF</name>
              <description>FIFO empty (transmit) or full (receive).</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXFIFOEMPTY</name>
                  <description>Transmit: FIFO empty.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFONOTEMPTY</name>
                  <description>Transmit: FIFO not empty.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FNE</name>
              <description>RX FIFO not empty.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTEMPTY</name>
                  <description>RX FIFO not empty.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMPTY</name>
                  <description>RX FIFO empty.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>ISO7816 interrupt enable</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000007F</resetMask>

          <fields>
            <field>
              <name>FHFEN</name>
              <description>FIFO Half Full interrupt enable.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

