sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
            <field>
              <name>FT2RENDEN</name>
              <description>TX to RX finished interrupt enable.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PEEN</name>
              <description>Parity Error interrupt enable.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OVREN</name>
              <description>RX FIFOI overflow interrupt enable.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FEREN</name>
              <description>Framing error interrupt enable.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TBERBFEN</name>
              <description>FIFO empty (transmit) or full (receive) interrupt enable.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FNEEN</name>
              <description>RX FIFO not empty interrupt enable.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>TCR</name>
          <description>ISO7816 transmit control</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>DMAMD</name>
              <description>DMA direction.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIP</name>
              <description>Parity select.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AUTOCONV</name>
              <description>Automatic conversion.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PROT</name>
              <description>PROT control.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TR</name>
              <description>Transmit/receive mode.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LCT</name>
              <description>Fast TX to RX.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SS</name>
              <description>Use first byte to configure conversion.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CONV</name>
              <description>Conversion inversion control.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>UCR</name>
          <description>ISO7816 user control</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000008</resetValue>
          <resetMask>0x0000000F</resetMask>

          <fields>
            <field>
              <name>RETXEN</name>
              <description>Enable TX/RX time configuration.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSTIN</name>
              <description>Reset polarity.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RIU</name>
              <description>ISO7816 reset.  This bit is write-only.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CST</name>
              <description>Clock control.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <description>ISO7816 data</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>DR</name>
              <description>Data register.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>BPRL</name>
          <description>ISO7816 baud rate low</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000074</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>BPRL</name>
              <description>Baud rate low</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>BPRH</name>
          <description>ISO7816 baud rate high</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x0000000F</resetMask>

          <fields>
            <field>
              <name>BPRH</name>
              <description>Baud rate high</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

