sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
          </fields>
        </register>
        <register>
          <name>UCR1</name>
          <description>ISO7816 user control 1</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000030</resetValue>
          <resetMask>0x0000003D</resetMask>

          <fields>
            <field>
              <name>ENLASTB</name>
              <description>Enable last byte function.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CLKIOV</name>
              <description>Output clock level.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>T1PAREN</name>
              <description>Parity check control.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STSP</name>
              <description>ETU counter control.  This bit is write-only.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PR</name>
              <description>Query Card Detect.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SR1</name>
          <description>ISO7816 interrupt status 1</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000008</resetValue>
          <resetMask>0x0000000F</resetMask>

          <fields>
            <field>
              <name>IDLE</name>
              <description>ISO7816 idle.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>ISO7816 idle.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>ISO7816 active.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCEND</name>
              <description>Write complete synchronization.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CMPL</name>
                  <description>Synchronization complete.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCMPL</name>
                  <description>Incomplete.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRL</name>
              <description>Card insert/remove.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INSREM</name>
                  <description>Card inserted/removed.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECNTOVER</name>
              <description>ETU counter overflow.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OVR</name>
                  <description>ETU overflow.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IER1</name>
          <description>ISO7816 interrupt enable 1</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>SYNCENDEN</name>
              <description>Write complete synchronization interrupt enable.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PRLEN</name>
              <description>Card insert/remove interrupt enable.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ECNTOVEREN</name>
              <description>ETU counter overflow interrupt enable.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ECNTL</name>
          <description>ETU counter low</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>ECNTL</name>
              <description>ETU counter low register.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ECNTH</name>
          <description>ETU counter high</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>ECNTH</name>
              <description>ETU counter high register.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

