sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
          </fields>
        </register>
        <register>
          <name>GTR</name>
          <description>ISO7816 guard time configuration</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000000FF</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>GTR</name>
              <description>Guard time configuration register.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>RETXCNT</name>
          <description>ISO7816 resend count</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <resetMask>0x0000000F</resetMask>

          <fields>
            <field>
              <name>RETXCNT</name>
              <description>Resend count register.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>RETXCNTRMI</name>
          <description>ISO7816 resent count inquiry</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>

          <fields>
            <field>
              <name>RETXCNTRMI</name>
              <description>Resent count inquiry register.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CLKCTRL</name>
          <description>Clock Control</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>APBCLKEN</name>
              <description>Enable the SCARD APB clock to run continuously.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CLKEN</name>
              <description>Enable the serial source clock for SCARD.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>SECURITY</name>
      <version>1.0</version>
      <description>Security Interfaces</description>
      <!-- <groupName>GROUP_SECURITY</groupName> -->
      <baseAddress>0x40030000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000090</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <register>
          <name>CTRL</name>
          <description>Control Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x800000F1</resetMask>

          <fields>
            <field>
              <name>CRCERROR</name>
              <description>CRC Error Status - Set to 1 if an error occurs during a CRC operation.  Cleared when CTRL register is written (with any value).  Usually indicates an invalid address range.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FUNCTION</name>
              <description>Function Select</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRC32</name>
                  <description>Perform CRC32 operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAND</name>
                  <description>DMA pseudo-random number stream based on CRC value</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GENADDR</name>
                  <description>Generate DMA stream based on address</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Function Enable.  Software should set the ENABLE bit to initiate a CRC operation.  Hardware will clear the ENABLE bit upon completion.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SRCADDR</name>
          <description>Source Addresss</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ADDR</name>
              <description>Source Buffer Address.  Address may be byte aligned, but the length must be a multiple of 4 bits.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>LEN</name>
          <description>Length</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFC</resetMask>

          <fields>
            <field>
              <name>LEN</name>
              <description>Buffer size (bottom two bits assumed to be zero to ensure a multiple of 4 bytes)</description>
              <bitRange>[23:2]</bitRange>
              <access>read-write</access>

