sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
            <field>
              <name>SIRLP</name>
              <description>This bit is the SIR low power select.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SIREN</name>
              <description>This bit is the SIR ENDEC enable.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>UARTEN</name>
              <description>This bit is the UART enable.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IFLS</name>
          <description>FIFO Interrupt Level Select</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000012</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>RXIFLSEL</name>
              <description>These bits hold the receive FIFO interrupt level.</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXIFLSEL</name>
              <description>These bits hold the transmit FIFO interrupt level.</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>Interrupt Enable</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FF</resetMask>

          <fields>
            <field>
              <name>OEIM</name>
              <description>This bit holds the overflow interrupt enable.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BEIM</name>
              <description>This bit holds the break error interrupt enable.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PEIM</name>
              <description>This bit holds the parity error interrupt enable.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FEIM</name>
              <description>This bit holds the framing error interrupt enable.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RTIM</name>
              <description>This bit holds the receive timeout interrupt enable.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXIM</name>
              <description>This bit holds the transmit interrupt enable.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXIM</name>
              <description>This bit holds the receive interrupt enable.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSRMIM</name>
              <description>This bit holds the modem DSR interrupt enable.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DCDMIM</name>
              <description>This bit holds the modem DCD interrupt enable.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTSMIM</name>
              <description>This bit holds the modem CTS interrupt enable.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXCMPMIM</name>
              <description>This bit holds the modem TXCMP interrupt enable.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IES</name>
          <description>Interrupt Status</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FF</resetMask>

          <fields>
            <field>
              <name>OERIS</name>
              <description>This bit holds the overflow interrupt status.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BERIS</name>
              <description>This bit holds the break error interrupt status.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PERIS</name>
              <description>This bit holds the parity error interrupt status.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FERIS</name>
              <description>This bit holds the framing error interrupt status.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

