sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
            <field>
              <name>RTRIS</name>
              <description>This bit holds the receive timeout interrupt status.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXRIS</name>
              <description>This bit holds the transmit interrupt status.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXRIS</name>
              <description>This bit holds the receive interrupt status.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSRMRIS</name>
              <description>This bit holds the modem DSR interrupt status.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DCDMRIS</name>
              <description>This bit holds the modem DCD interrupt status.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTSMRIS</name>
              <description>This bit holds the modem CTS interrupt status.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXCMPMRIS</name>
              <description>This bit holds the modem TXCMP interrupt status.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <description>Masked Interrupt Status</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FF</resetMask>

          <fields>
            <field>
              <name>OEMIS</name>
              <description>This bit holds the overflow interrupt status masked.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BEMIS</name>
              <description>This bit holds the break error interrupt status masked.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PEMIS</name>
              <description>This bit holds the parity error interrupt status masked.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FEMIS</name>
              <description>This bit holds the framing error interrupt status masked.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RTMIS</name>
              <description>This bit holds the receive timeout interrupt status masked.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXMIS</name>
              <description>This bit holds the transmit interrupt status masked.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXMIS</name>
              <description>This bit holds the receive interrupt status masked.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSRMMIS</name>
              <description>This bit holds the modem DSR interrupt status masked.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DCDMMIS</name>
              <description>This bit holds the modem DCD interrupt status masked.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTSMMIS</name>
              <description>This bit holds the modem CTS interrupt status masked.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXCMPMMIS</name>
              <description>This bit holds the modem TXCMP interrupt status masked.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IEC</name>
          <description>Interrupt Clear</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FF</resetMask>

          <fields>
            <field>
              <name>OEIC</name>
              <description>This bit holds the overflow interrupt clear.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BEIC</name>
              <description>This bit holds the break error interrupt clear.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PEIC</name>
              <description>This bit holds the parity error interrupt clear.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

