sparkfun/AmbiqSuiteSDK/pack/SVD/apollo3c.svd
            </field>
            <field>
              <name>OUTLOW</name>
              <description>This bit is the vcompout low interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTSTAT</name>
          <description>Voltage Comparator Interrupt registers: Status</description>
          <addressOffset>0x00000204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>OUTHI</name>
              <description>This bit is the vcompout high interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OUTLOW</name>
              <description>This bit is the vcompout low interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTCLR</name>
          <description>Voltage Comparator Interrupt registers: Clear</description>
          <addressOffset>0x00000208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>OUTHI</name>
              <description>This bit is the vcompout high interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OUTLOW</name>
              <description>This bit is the vcompout low interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTSET</name>
          <description>Voltage Comparator Interrupt registers: Set</description>
          <addressOffset>0x0000020C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>OUTHI</name>
              <description>This bit is the vcompout high interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OUTLOW</name>
              <description>This bit is the vcompout low interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>WDT</name>
      <version>1.0</version>
      <description>Watchdog Timer</description>
      <!-- <groupName>GROUP_WDT</groupName> -->
      <baseAddress>0x40024000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000210</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>WDT</name>
        <value>1</value>
      </interrupt>
      <registers>
        <register>
          <name>CFG</name>
          <description>Configuration Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00FFFF00</resetValue>
          <resetMask>0x07FFFF07</resetMask>

          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Select the frequency for the WDT.  All values not enumerated below are undefined.</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Low Power Mode.  This setting disables the watch dog timer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128HZ</name>
                  <description>128 Hz LFRC clock.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16HZ</name>
                  <description>16 Hz LFRC clock.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1HZ</name>
                  <description>1 Hz LFRC clock.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1_16HZ</name>
                  <description>1/16th Hz LFRC clock.</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTVAL</name>
              <description>This bitfield is the compare value for counter bits 7:0 to generate a watchdog interrupt.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESVAL</name>
              <description>This bitfield is the compare value for counter bits 7:0 to generate a watchdog reset.  This will cause a software reset.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESEN</name>
              <description>This bitfield enables the WDT reset.  This needs to be set together with the WDREN bit in REG_RSTGEN_CFG register (in reset gen) to trigger the reset.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

